{
  "articles": [
    {
      "article_title": "Great Web3 games should be fully — not partially — on-chain",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/great-web3-games-should-be-fully-not-partially-on-chain",
        "name": "Felix Xu"
      },
      "article_detailed_content": "Gaming has been a catalyst in resurrecting Web3 from a year-long winter. It’s also a key force for mass adoption. Yet, the journey towards fully realizing the potential of Web3 gaming is fraught with challenges, notably the seamless integration of on-chain elements without sacrificing the core tenets of decentralization and player empowerment.\nNew users should only experience friction if necessary, and as late as possible. That’s not the case with most existing Web3 games. From connecting their wallets upfront to signing transactions for verification, users face multiple hurdles before actually trying the game. These frictions contrast starkly with the vision of a seamless and accessible gaming world that fully on-chain gaming aspires to achieve.\nTitles such as Axie Infinity and CryptoKitties, though groundbreaking, fall short of being fully on-chain. Fully on-chain games store all game assets, mechanics, and states on the blockchain. This radical approach ensures unparalleled transparency, security, and player control, allowing for a truly decentralized gaming experience where players own and shape their digital destinies.\nRelated: Axie Infinity is toxic for crypto gaming\nBuilding the best game demands a functional, efficient combination of on-chain elements and the rich user experience of legacy titles.\nHolding Web3 games to Web2 standards is comparing apples to oranges. Their requirements, value propositions, and scopes differ greatly despite serving similar audiences.\nWeb3 games are meant to solve age-old problems like top-down models, lack of user control, and strong-arming by gaming corporations. That’ll happen only by implementing alternative models, processes, and principles — not by emulating the outcomes achieved in Web2.\nWe can even argue that terms like “engaging,” “seamless,” and “hassle-free,” will take on new meanings in this context, enhanced by other aspects like community orientation, real in-game value, and user-generated logic.\nTherefore, when building Web3 games, the most crucial requirement is to address novel challenges, ideally involving embracing innovative technologies and models that align with the principles of autonomy and community governance. It’s about building “Autonomous Worlds” (AWs), a concept introduced in 2022 by Ludens — the founder of Lattice.xyz — to describe “a world with a blockchain substrate.”\nMoreover, new-age games must nurture and serve the expanding community of problem-aware gamers. Those who seek genuine solutions to the odds stacked against them in legacy gaming. Not mere bounty hunters and fleeting profit-mongers.\nBuilding fully on-chain games\nIronically, Axie Infinity and CryptoKitties served as pivotal catalysts in the evolution of blockchain gaming — but they weren't fully on-chain. They were experimental, niche, and heavily crypto-centric, characterized by their clunky user interfaces. Despite opening up new avenues, they weren’t entirely \"Autonomous Worlds\" either. Users had little or no control over the rules and direction of the game, and only parts of the game states were on-chain.\nneed help my ship is stuck in the ░F░O░G░ pic.twitter.com/Hn6jn3NTOK\n— The Citadel (@0xCitadel) March 6, 2024\nDark Forest was the first decentralized real-time strategy game, released in 2020. Using zero-knowledge proofs (zkProofs), a cryptographic protocol, to create a “fog of war” in the gaming experience, this project set an example in building incomplete information games on-chain. For reference, think of games like poker, where players only see their hands and don’t know what cards others have.\nThe challenge Dark Forest tackled was maintaining a publicly accessible distributed ledger without compromising the confidentiality of players' strategies — a fundamental aspect in any strategic gameplay.\nUsing zkProofs, Dark Forest maintained gameplay integrity and player privacy on a blockchain. This approach solved the critical issue of revealing sensitive game states (e.g., planet locations or attack trajectories), which is easily manageable with centralized servers but very challenging in decentralized environments. Dark Forest's solution set a precedent for real-time strategy gaming on the blockchain, providing a blueprint for future on-chain game development.\nThey even sparked the proliferation of community-oriented, bottom-up AWs: Mithraeum, Citadel, ZkHunt, and so on. Loot Project was another interesting addition to this space, letting users permissionlessly expand the IP and spawning hundreds of games, lores, etc.\nMithraeum. Source: Screenshot\nBy putting everything on-chain — from game states (assets, actions, etc.) to logic (rules of introduction, mechanisms for in-game interactions, etc.), AWs unlock flexible and resilient digital realities where users come of their own.\nGoing beyond in-game asset ownership, they incentivize players to attach greater significance to their on-chain gaming activities. More importantly, on-chain logic provides gamers with a meaningful say in what’s legitimate and what’s not in the game-world.\nThis is a massive departure from the status quo, where end-users are mostly passive consumers, playing at the whims and mercy of corporate publishers. Rules and norms emerge via community consensus, not the arbitrary will of external entities. And they serve grassroots interests. Players can build, contribute, monetize, and participate in ways that are impossible in Web2 games.\nRelated: Why Solana will prevail despite Ethereum ETFs\nThe empowering, skin-in-the-game nature of AWs instills a stronger desire for mastery in gamers. They’re more driven to find creative solutions to solve problems and create mods and plugins to establish entirely separate economies within the game. This participatory fosters a deeper connection to the game, encouraging creativity, problem-solving, and collaboration within the community. For example, Dark Forest players have built a range of bots, plugins, and custom clients they can use to climb a leaderboard.\nAs we look to the future, the journey towards fully on-chain gaming is not without its challenges, yet the promise it holds is immense. By redefining engagement, ownership, and control within the digital realm, on-chain gaming is poised to offer experiences that more closely mirror real-world interactions and relationships. In doing so, it not only enhances the richness of virtual worlds but also establishes a new standard for what gaming can be—truly immersive, empowering, and reflective of the players' desires and aspirations.\nThe principles of decentralization, player sovereignty, and community collaboration will be the guiding lights, shaping the future of gaming into an inclusive, democratic, and exciting digital frontier.\nFelix Xu is a co-founder and CEO of ARPA. Felix graduated with Finance and Information Systems degrees from New York University. For the past six years, Felix has been working on venture capital investment in fintech, big data and AI startups. Most recently, Felix led blockchain sector research and early-stage investment at Fosun Group, one of the largest conglomerates in China.\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.",
      "article_summary": "Unlike games that rely partly on centralization (Axie Infinity), fully on-chain games give players more control — and get them more engaged.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Cryptocurrencies",
        "#Games",
        "#Blockchain Game",
        "#Web3",
        "#Gaming",
        "#Axie Infinity",
        "#GameFi"
      ],
      "category": "OPINION",
      "article_link": "https://cointelegraph.com/news/great-web3-games-should-be-fully-not-partially-on-chain",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "FDIC official urges better digital asset policy to maintain US influence",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/fdic-official-urges-better-digital-asset-policy-maintain-us-influence",
        "name": "Derek Andersen"
      },
      "article_detailed_content": "Bank customers and the United States economy could lose opportunities if a poor approach is taken to regulating blockchain technology, U.S. Federal Deposit Insurance Corporation (FDIC) vice chair Travis Hill told an audience at the Mercatus Center think tank on March 11. The United States is already at risk, Hill said, and the FDIC shares the blame for that.\nTokenization of bank deposits and other real-world assets (RWA) could make it possible to carry out financial transaction at any time with real-time settlement, Hill said. In addition, it would provide programmability of payments, making it possible to conduct intraday repurchase (repo) exchanges and improve settlement times for some bond issuances and numerous other transactions. Consumers could also benefit from using programmable payments in place of escrow.\nAmong the many open questions about tokenization, Hill mentioned the use, or not, of unified ledgers, blockchain interoperability and ownership rights as assets move along the blockchain. Furthermore:\n“Global standards are being established, directly or indirectly, and with many non-U.S. jurisdictions actively engaged in this area, the United States risks ceding influence at this critical stage.”\nProgrammability could reduce settlement risks and Know Your Customer processes, but it could also allow consumers to move their assets quickly, aggravating bank runs. An “off” switch is needed to prevent that, Hill said.\nSource: @FDICgov on X\nRegulatory agencies attempted in the past to set consistent policies with little luck, so “instead, the agencies established processes under which institutions must engage with their regulator on an individual basis,” Hill said.\nRelated: Inspector General wants FDIC to refine crypto risk assessment process, guidance\nLooking at FDIC regulations, which treat all transactions on a blockchain — whether they involve RWA or crypto — the same, Hill found them to be cumbersome and unequally applied:\n“Institutions have spent months responding to a long stream of information requests, diverting attention away from developing new technologies and systems. […] The message being heard by the vast majority of the industry could be interpreted as don't bother trying.”\nGuidance is needed from regulators, as is consistency so that deposits in any form are treated the same, Hill said. He criticized the Securities and Exchange Commission’s (SEC’s) controversial Staff Accounting Bulletin 121 (SAB 121), which requires financial institutions to treat crypto assets differently from any other kind of asset. The definition of crypto asset used in the bulletin is broad enough to include tokenized RWA, he said.\nMagazine: Block by block: Blockchain technology is transforming the real estate market\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nA weekly summary of the latest news in crypto legislation and regulations. Delivered every Monday\nSubscribe",
      "article_summary": "FDIC vice chair Travis Hill did not spare his own agency in his assessment of current digital asset regulation.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#United States",
        "#Tokens",
        "#Regulation"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/fdic-official-urges-better-digital-asset-policy-maintain-us-influence",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Israel announces plans for interest-bearing shekel CBDC",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/israel-announces-plans-interest-bearing-shekel-cbdc",
        "name": "Zhiyuan Sun"
      },
      "article_detailed_content": "Israel’s central bank will support a new Israeli shekel central bank digital currency (CBDC) that has the option of bearing interest.\nIn the March 11 announcement, the Bank of Israel outlined that its shekel CBDC will be implemented in a two-tier model, with instant, 24/7 payments, multipayment support, offline use, limitations on balances and an option for the CBDC to become interest-bearing. The central bank wrote: \n“In the area of privacy, the architecture will allow the central bank, as the system administrator, to define the types of information required for the operation, control, and monitoring of the system. However, the central bank will not have access to personally identifiable information about end users’ balances and transactions.”\nCurrently, commercial banks in Israel pay 4.86% interest on customers’ fiat shekel deposits and savings. Under the central bank’s plans, banks would be able to hold the shekel CBDC as part of their short-term liquidity buffer, which would be non-interest bearing. \n“The data structure must enable the system to comply with all of the assumptions defined in Section 2.1, including the ability to enforce holding restrictions and to apply interest,” researchers wrote, adding: “In particular, in a case where the interest is dependent on the type of user and the size of the balance, there is an advantage to having a centralized database.”\nIsrael has been contemplating the issuance of a digital shekel since 2021, but no concrete pilot tests have been actioned as of the time of publication. “Given the interdependence between the various components of the digital shekel system, the decisions are not final,” said the Bank of Israel. \nIn April 2023, Cointelegraph reported that the country’s central bank could issue a shekel CBDC if stablecoin use increases. “At this point, there are no signs of substantial adoption of stablecoins as means of payment in Israel,” the central bank said at the time.\nRelated: Local Web3 community launches ‘Crypto Aid Israel’ to help displaced citizens\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nA weekly pulse of the business behind blockchain and crypto. Delivered every Thursday\nSubscribe",
      "article_summary": "Although plans for a shekel CBDC have been in place since 2021, no pilot tests have since carried forward.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Israel",
        "#Business",
        "#Adoption",
        "#CBDC"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/israel-announces-plans-interest-bearing-shekel-cbdc",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Music NFTs can reshape the indie music industry — Here’s how",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/music-nfts-can-reshape-the-indie-music-industry-heres-how",
        "name": "Janina Winter"
      },
      "article_detailed_content": "Independent (indie) musicians face many challenges on their way to recognition and financial stability, often stemming from the centralized nature of Web2 platforms such as Spotify, Apple Music and SoundCloud. While these platforms initially offered promising paths to exposure, the reality has fallen short, leaving artists struggling to secure fair compensation in terms of royalties and control over their work.\nThe issue lies in the way streaming services distribute revenue: a meager portion reaches the artists themselves, with record labels often negotiating significantly higher payouts than indie musicians for their work. Spotify’s reported payout per stream further exemplifies this disparity, falling within a paltry range of $0.003 to $0.005 in 2024.\nAdding insult to injury, Spotify’s recent policy change throws another obstacle in the path of indie artists. In 2024, the platform will cease royalties for tracks receiving fewer than 1,000 streams within a year. While technicalities suggest these tracks will still accrue royalties, the funds will be funneled upward, often benefiting bigger artists. This 1,000-stream cliff creates a significant barrier for indie musicians attempting to break through and build a fanbase.\nOne stat you won’t find in your Spotify Wrapped is how much artists are paid for all that listening on the platform.\n\nThe max possible in 2023 is $0.003 per stream. And in 2024, Spotify will stop paying anything AT ALL for 2/3 of the tracks on the platform. pic.twitter.com/OCMHsHNce5\n— United Musicians and Allied Workers (@UMAW_) November 29, 2023\nAnother major challenge for indie artists is building a loyal fanbase. The current market is saturated with countless independent artists vying for attention. Building a personal brand and effectively utilizing social media platforms can help indie musicians connect with their audience and cultivate a fanbase, but it takes time, money and effort to make it big.\nHow NFTs can help musicians\nThis is where Web3, particularly nonfungible tokens (NFTs), emerges as a solution with the potential to transform the indie music industry. Music NFTs allow artists to sell songs, albums or exclusive digital content directly to their fans. The NFT approach bypasses intermediaries like record labels and streaming platforms, allowing artists to capture a larger share of the revenue generated by their work. Unlike streaming, where earnings are based on unpredictable play counts, NFTs offer the potential for more transparent and direct income streams.\nMusic NFTs also act as a bridge between artists and their fans, fostering a sense of community and ownership. By owning an NFT, fans actively support the artist and gain access to various benefits like early access to new songs or exclusive behind-the-scenes content.\nThe limitations of current music NFTs\nWhile music NFTs already exist on several blockchains, they can only represent one digital asset, such as a single song. This restriction is highly inflexible, as musicians typically work with multiple songs packaged as an album or playlist.\nThe current music NFTs are permanently static, lacking the capacity for updates or changes. Musicians desire the ability to evolve and modify their music and copyright terms over time, enhancing fan engagement by offering a continuous stream of fresh content.\nAlthough music NFTs hold great promise for fostering deeper connections with fan bases, this potential hinges on one critical factor — the ability to update the information embedded in the NFT itself.\nIntroducing dynamic Data NFTs\nItheum Protocol, an omni-chain data ownership infrastructure layer , aims to overcome these limitations by allowing musicians to develop and update their content through its Music Data NFT technology.\nAt the heart of the Itheum Protocol lies Data NFT technology, which allows musicians to transform static or dynamic data assets into NFTs. These NFTs function as transferable licenses, granting ownership and control over sharing or trading access rights to the data. Data NFTs empower creators to tokenize their data, similar to other NFT assets, but with the added flexibility of managing access rights.\nUnlike traditional NFTs that represent static assets, Music Data NFTs can be updated by artists, allowing for evolving content. This dynamic capability has the potential to enhance fan engagement, offering features like unlocking additional content upon interaction. Moreover, Music Data NFTs give artists greater control over distribution and royalty structures.\nVerified fans who own Data NFTs can also establish direct communication with artists, creating access opportunities for exclusive content such as unreleased music or merchandise. This connection could strengthen the bond between musicians and their fanbase.\nCointelegraph Accelerator participant Itheum envisions Music Data NFTs operating seamlessly across various blockchains. The envisioned interoperability enables artists to access diverse NFT ecosystems, potentially building fanbases and extending their exposure to a broader audience across various blockchain communities.\nKey features of Data NFTs. Source: Itheum Protocol\nGiving the power to musicians and fans\nMusicians can showcase their Music Data NFTs on NF.Tunes, a Web3 music portal built on Itheum Protocol’s technology. The platform serves as a space for artists to exhibit their music Data NFTs, allowing fans to explore and listen to new music while engaging with artist communities.\nWith its Music Data NFTs, Itheum paves the way for a more artist-centric future in the music industry. By addressing the limitations of the current NFT models, Itheum offers a glimpse into a future where indie musicians not only navigate the labyrinthine world of music but thrive in it.\nAre you an indie musician who wants to use Music Data NFTs? Get onboarded here.\nLearn more about Itheum Protocol\n#Blockchain\n#Music\n#Data\n#Web3\n#NFT\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.",
      "article_summary": "Existing music NFTs can only represent one song and can’t be updated, limiting artists who want to offer evolving content.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Music",
        "#Data",
        "#Web3",
        "#NFT"
      ],
      "category": "USE CASE",
      "article_link": "https://cointelegraph.com/news/music-nfts-can-reshape-the-indie-music-industry-heres-how",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Inside Altcoin Daily’s crypto bull market strategy",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/inside-altcoin-daily-crypto-bull-market-strategy",
        "name": "Marco Castrovilli"
      },
      "article_detailed_content": "Bitcoin price is likely to experience a major correction around the Bitcoin halving anticipated for April, according to Aaron and Austin Arnold, the founders of the Altcoin Daily YouTube channel.  \nStill, they said the price dip will be quickly bought by institutional players such as BlackRock, which have been deeply involved in the market since the approval of Bitcoin (BTC) spot exchange-traded funds (ETFs) in January.\nBitcoin recently broke through its previous all-time high, reaching north of $72,000. \nThe current rally appears to be driven by BlackRock, Fidelity and other institutional investors buying Bitcoin for their new ETFs.\nAccording to Austin, the latest rally caught many retail investors off guard, as they were not expecting Bitcoin to rise so rapidly toward its all-time highs.\n“A lot of people would welcome a crash. I think the institutions are trying as hard as they can not to let that happen,” he said.\nAccording to his brother, Aaron, the big differentiator between this and previous bull runs is that spot ETFs have allowed Bitcoin to cross the chasm between early adopters and the early majority, referencing the lifecycle of technology adoption. \n“Wall Street is in for real this time,” he said. “That is a big differentiator.” \nAt the same time, they said the bulk of retail investors have not entered the market yet, which seems to suggest that we are still in a relatively early stage of the bull market.\n“Retail largely isn’t here yet based on the social engagement, on Google Trends,” Austin said. \nTo find out more about Altcoin Daily’s outlook on the current bull market, check out the full interview on Cointelegraph’s YouTube channel — and don’t forget to subscribe!",
      "article_summary": "Popular crypto YouTubers Austin and Aaron Aarnold share their tips to take the most out of the current bull market in an exclusive interview with Cointelegraph.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Bitcoin",
        "#Blockchain",
        "#Cryptocurrencies",
        "#Altcoin",
        "#Ethereum",
        "#Bitcoin Price",
        "#Technology",
        "#Bitcoin Analysis",
        "#Investments",
        "#SEC",
        "#Adoption",
        "#Markets",
        "#Predictions",
        "#Tokens",
        "#Market Update",
        "#Market Analysis",
        "#Trading",
        "#Ether Price",
        "#Bitcoin",
        "#Cryptocurrencies",
        "#Elections",
        "#Donald Trump",
        "#CBDC",
        "#Regulation"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/inside-altcoin-daily-crypto-bull-market-strategy",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Ubisoft is now a validator on the XPLA blockchain",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/futureverse-studios-debuts-trailer-web3-readyverse-battle-royale-game",
        "name": "Tristan Greene"
      },
      "article_detailed_content": "Ubisoft, the maker of several hit gaming franchises — including Assassin’s Creed and Far Cry — has joined the XPLA blockchain as a node validator. \nThe French gaming giant has long dabbled in Web3, blockchain and cryptocurrency services alongside its gaming verticals. This latest move, made through its Strategic Innovation Lab, sets the stage for Ubisoft to contribute to the XPLA network beyond principal validation duties.\nAccording to a press release from XPLA, Ubisoft will “actively participate in governance proposal decisions” as part of the partnership. \nBlockchain\nXPLA is a Tendermint-based, layer-1, open-source blockchain developed to foster the transition from Web2 to Web3 gaming. Its mainnet was launched in August 2022 with the stated core goal of empowering players in a “play to own” gaming paradigm.\nSome of the most popular intellectual properties with games on the XPLA blockchain include The Walking Dead: All-Stars and Summoners War: Chronicles.\nPer a blog post from XPLA, its latest partnership is a growth marker for the network:\n“The addition of Ubisoft, a global gaming company, to the XPLA family is just the beginning! We eagerly anticipate more validators joining our ecosystem, enhancing the security and stability of our network.”\nGaming\nUbisoft, based in Rennes, France, is among the world’s largest gaming companies. Its games have won myriad awards and sold a combined total of somewhere around 800 million titles. With a market capitalization of $2.75 billion as of the time of publication, it’s the second largest in Europe, behind only Poland’s CD Projekt Red ($2.99 billion).\nThe company was among the earliest gaming firms to invest in Web3 and blockchain technology. Back in 2021, it published a manifesto laying out its plans in the blockchain and Web3 spaces with heavy emphasis on player agency and ownership.\nAs Cointelegraph reported in October 2021, Ubisoft is also a major investor in Animoca Brands, a Hong Kong-based blockchain games developer. \nBlockchain gaming continues to rise in popularity as the Web3 space begins to fill out. While it still hasn’t reached its early promises of decentralizing gaming assets at scale and revolutionizing the role of nonfungible tokens (NFTs) in the public perception, the steady entrance of major gaming outfits such as Ubisoft and Square-Enix bodes well for the sector.\nRelated: Square Enix will modify organizational structure to support blockchain, Web3, AI in 2024\nExplore more articles like this\nSubscribe to the Nifty Newsletter\nA weekly summary of the latest NFT headlines. Delivered every Wednesday\nSubscribe",
      "article_summary": "The blockchain gaming sector is starting to pick up steam.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Business",
        "#Games",
        "#Blockchain Game",
        "#NFT",
        "#Gaming"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/ubisoft-validator-web3-nft-xpla-blockchain-gaming",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Bitcoin miner Bitfarms purchases additional 51,908 ASICs amid bull market",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/israel-announces-plans-interest-bearing-shekel-cbdc",
        "name": "Zhiyuan Sun"
      },
      "article_detailed_content": "Canadian Bitcoin (BTC) miner Bitfarms exercised an option on March 11 to purchase 28,000 Bitmain T21 ASIC miners and 19,280 Bitmain T21 miners, for $14 per terrahash (TH) as well as 3,888 Bitmain S21 miners and 740 Bitmain S21 hydro miners for $17.50/TH, for a total of 51,908 ASICs. \nAt the time of publication, each Bitmain T21 ASIC miner costs around $3,000 retail and possesses a hash rate of 190 TH/s. \nGeoff Morphy, president and CEO of Bitfarms, said the company secured additional miners \"before anticipated hardware price increases.\" He also noted that the ASICs are scheduled for delivery this year and are expected to bring the firm's total hash rate to 21 exahashes per second (EH/s), or around 3% of the processing capacity of the Bitcoin network. \nOn March 8, Bitfarms announced a $375 at-the-market (ATM) million equity offering program. “The Company intends to use the net proceeds of the ATM Program, if any, primarily on capital expenditures to support the growth and development of the Company’s existing mining operations as well as for working capital and general corporate purposes,” Bitfarms wrote.\nThe company currently has 11 operating Bitcoin mining facilities, with additional developments in Canada, the United States, Paraguay and Argentina.\nDespite an ongoing crypto bull market, Bitfarms’ stock has fallen over 38% this year, as with its peers, even as Bitcoin reached new all-time highs. The reason can be partially attributed to the upcoming Bitcoin halving in April, where block rewards are scheduled to be slashed in half, thereby reducing miners’ bottom line. The firm has been actively scaling its operations in the past year in anticipation of the halving event. \nRelated: Bitcoin breaches $71K for the first time",
      "article_summary": "The price of Bitcoin has reached an all-time high above $72,000.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Bitcoin",
        "#Blockchain",
        "#Cryptocurrencies",
        "#Adoption"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/bitcoin-miner-bitfarms-purchases-additional-51908-asics-amid-bull-market",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Korean MMORPG MapleStory opens gaming experience on Avalanche",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/israel-announces-plans-interest-bearing-shekel-cbdc",
        "name": "Zhiyuan Sun"
      },
      "article_detailed_content": "MapleStory, a massively multiplayer online role-playing game (MMORPG) developed by South Korean video game publisher Nexon with over 400,000 daily active users, will expand its gaming experience to the Avalanche blockchain.\nAccording to a March 11 announcement dubbed “MapleStory N,” the game will be powered by an Avalanche subnet on the namesake blockchain’s cloud network “to proceed without a separate implementation partner, providing greater convenience, more support options, and quick time to market” and offer users new content-generating opportunities. “Users can build out enticing new worlds, extending gameplay, and adding their footprint to the MapleStory Universe,” a spokesperson for Avalanche wrote.\nThe game is scheduled to launch later in 2024. “Our partnership with Ava Labs will allow us to build a stable and complete blockchain ecosystem, enabling us to securely service various dApps along with MapleStory N to amplify our competitiveness,” commented Angela Son, MapleStory Universe’s partnership lead.\nCreated in 2003, MapleStory has immense popularity in the Asia-Pacific region and has surpassed 180 million registered players. Its Web3 venture, MapleStory Universe, uses various nonfungible tokens (NFTs) to enhance the in-game experiences.\nSimilarly, on March 22, 2023, its parent Nexon selected the Ethereum layer-2 scaling solution Polygon to power its blockchain ecosystem. According to Nexon, a Polygon supernet created by Polygon Labs will be deployed within Maplestory to allow players to earn and collect in-game items as NFTs. \nYes yes, I know it's been a while, took my vacation anyway. Crucify me.\n\nSoooo...marketplace (special thanks to all the fans out there, your likes have brought us here ). What's new? pic.twitter.com/gVY8lRaYrM\n— MapleStory Universe (@MaplestoryU) March 5, 2024\nThe Avalanche network has been gaining traction in 2024, partly due to traditional financial heavyweights, such as JPMorgan and Citi, partnering with the Avalanche Foundation for their real-world asset tokenization initiatives and new technological deployments on its blockchain.\nOn Jan. 15, Cointelegraph reported that Avalanche inscriptions drew record user interest amid a hype of Bitcoin BRC-20 inscription tokens. Over 100 million Avalanche inscriptions have been minted since their creation in 2023.\nRelated: Justin Sun vs. SEC, Do Kwon arrested, 180M player game taps Polygon",
      "article_summary": "The game was created in 2003 and has had over 180 million user signups since its inception.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Adoption",
        "#Avalanche",
        "#Gaming"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/korean-mmorpg-maplestory-opens-gaming-experience-avalanche",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Tether stablecoin USDT is coming to Celo blockchain",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/tether-stablecoin-usdt-celo-blockchain",
        "name": "Helen Partz"
      },
      "article_detailed_content": "Major stablecoin operator Tether continues to expand its USDT stablecoin across various blockchain networks, entering a strategic collaboration with the Celo network.\nTether (USDT) on Celo, an Ethereum Virtual Machine (EVM)-compatible layer-1 network designed for fast and low-cost payments.\nAnnouncing the news to Cointelegraph on March 11, Tether noted that the new integration brings a range of benefits to USDT, including “notably low, sub-cent transaction fees” hovering around $0.001, enabling feasible microtransactions.\n“One of Celo’s core features since launching in April 2020 was its design for fast, low-cost payments worldwide,” a source close to Celo told Cointelegraph. “Indirectly, as an L2, there is a value sharing happening with Ethereum that’s not happening today as an L1,” a spokesperson said, adding:\n“In transitioning to an Ethereum L2, gas fees would stay low, critical to achieving global prosperity and core to the Celo community mission.”\nUSDT will join an array of stable assets available on the Celo platform, including Mento’s eXOF, which tracks the CFA franc, and the cREAL, which tracks the Brazilian real. The use cases for stable assets on Celo include remittances, savings, lending and cross-border payments.\n“We are thrilled to welcome Tether USDT to the Celo ecosystem, which is fast becoming a leader in stablecoins and real-world assets,” Celo co-founder and foundation president Rene Reinsberg said.\n“With Tether USDT soon available on Celo, users have even more options for fast, low-cost payments and access to robust stablecoin use cases that benefit everyday users around the world,” Reinsberg noted.\nA Tether representative declined to say when the first batch of USDT will be issued and go live on the Celo blockchain.\nRelated: Tether launches recovery tool to migrate USDT between blockchains\nUSDT’s major rival, the Circle-issued USD Coin (USDC), announced a native launch on the Celo blockchain in January 2024 as well. Circle said the first USDC became available on Celo on Feb. 22.\nCelo-based USDT will join 14 blockchains currently supported by Tether, including Tron, Ethereum, Solana, Avalanche and Omni. Tron and Ethereum are the two largest blockchains for USDT at the time of writing, accounting for 50% and 45% of all issued USDT, respectively, according to Tether Transparency.\nThe news comes amid the crypto community increasingly complaining about high fees on the Ethereum network as Ether (ETH) prices pass $4,000. Skyrocketing ETH fees have also impacted Ethereum-based USDT, as ERC-20 Tether USDT requires ETH gas fees to complete transactions.\nDespite Celo being an EVM-compatible network, there is no dependency on Ethereum in terms of network fees, according to a source close to Celo. “For example, if Ethereum fees go up, it doesn’t mean L2 fees, given certain architectural choices, go up in the same way or at all even,” the person noted.\nMagazine: The DeFi bots pumping Solana’s stablecoin volume",
      "article_summary": "Tether has entered a collaboration with Celo to enable “sub-cent transaction fees” for USDT and facilitate feasible microtransactions.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Cryptocurrencies",
        "#Altcoin",
        "#Tether",
        "#Stablecoin",
        "#Celo"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/tether-stablecoin-usdt-celo-blockchain",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Whales, Sybil attacks and low trust: Can DAOs avoid centralization pitfalls?",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/music-nfts-can-reshape-the-indie-music-industry-heres-how",
        "name": "Janina Winter"
      },
      "article_detailed_content": "Imagine a future where organizations operate not under individuals’ control but by a community’s collective will. Decisions are made collaboratively in an environment where the power is distributed among members, not concentrated in a central authority. This concept, once confined to the realm of science fiction, is now taking shape in the form of decentralized autonomous organizations (DAOs).\nDAOs are internet-based organizations fueled by blockchain technology. They function through smart contracts, self-executing code that automates decision-making based on established rules. Ownership and voting rights are often linked to crypto tokens, empowering members to actively shape the DAO’s trajectory. This structure upholds transparency as all transactions and decisions are permanently recorded on the blockchain, accessible for public scrutiny.\nThe challenges around DAOs\nBut as with any disruptive innovation, DAOs come with their own set of challenges, raising a critical question: can they truly revolutionize governance, or are they destined to remain a captivating experiment?\nOne of the most significant challenges facing DAOs is the potential for large tokenholders, known as whales, to influence voting outcomes in their favor. Due to their extensive holdings, whales can manipulate governance outcomes, undermining the collective decision-making process and jeopardizing the fairness and legitimacy of the DAO. According to a research paper, voting power in DAO governance systems is unfair and highly centralized, with fewer than 10 addresses having full control over most DAOs. The study shows that for crypto platforms Compound, Fei and Uniswap, the community delegate vote share is low at about 10% or less.\nThe centralization issue in the voting process is further exacerbated by Sybil attacks, where individuals impersonate multiple voters to skew outcomes using the ease of creating multiple accounts. These attacks can erode trust and hinder the legitimacy of a DAO’s governance.\nWhile some participants in DAOs may be aligned with collective interests and long-term goals, investors will inevitably be driven solely by quick profits, disregarding a project’s sustainability and future. The intrinsic importance of tradeable governance tokens in DAO operations makes aligning financial incentives and community interests challenging, particularly in optimizing a project’s growth potential over time.\nRecognition of diverse contributions\nSecure identity verification measures and a transparent governance system can solve the problems within DAOs. AirDAO, a community-governed layer-1 blockchain, recognizes the solution and aims to make decentralized finance (DeFi) more accessible, fair and user-friendly for everyone.\nBuilt on its own blockchain network -AMB-NET- AirDAO offers a product suite to simplify complex financial operations. The suite includes cross-chain bridging to Ethereum and BNB Smart Chain along with a staking platform, a multichain network explorer and FirepotSwap — a native decentralized exchange (DEX) developed in partnership with Firepot Finance.\nUnderstanding the challenges of governance manipulation and multiple account creation, AirDAO implemented solutions to foster a fairer and more inclusive decision-making process:\nFacial verification: Through a partnership with Fractal ID, a provider of Web3 identity solutions, AirDAO links wallets to users using facial verification technology. The integration enables the creation of decentralized identifiers (DIDs) that verify identities without requiring the disclosure of personal information or compromising user anonymity. Facial verification reduces the ability to create multiple accounts, ensures each vote is from a unique participant and promotes transparency and accountability.\nThe issuance of the AirDAO’s governance soulbound token (SBT), AMB, is also based on the user’s facial recognition biometric data verified by Fractal ID.\nImpact-based governance: AirDAO’s system rewards users with soulbound tokens (SBTs) based on their contributions to the platform, such as providing liquidity or participating in governance discussions. SBTs determine an individual’s voting power, giving a stronger voice to those who actively contribute to the project’s success.\nAirDAO rewards the community for contributing to its ecosystem with impact-based SBTs. Source: AirDAO\nAirDAO recognizes that its success relies on the contributions of a diverse community. Whether users validate transactions, contribute their skills or champion AirDAO as a Governor or Ambassador, their efforts will be crowned with governance SBTs that reflect users’ benefits to the ecosystem.\nA vision for decentralization\nAirDAO’s Governance Working Group (GWG), comprised of around 30 community members with expertise in various fields, underlines the platform’s commitment to community governance.\nAirDAO’s vision is to complete decentralization and become a fully community-governed project that fosters collective decision-making within the DeFi space. If successful, AirDAO’s potential to address key challenges in DAO governance could pave the way for a more equitable and trustworthy future for DAOs and the wider DeFi ecosystem.\nLearn more about AirDAO Governance Platform\nJoin support Telegram group for AirDAO governors\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.",
      "article_summary": "DAOs promise collective and transparent decision-making. However, whales and fake accounts threaten fair voting.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Security",
        "#Decentralization",
        "#Identity",
        "#DAO",
        "#DeFi"
      ],
      "category": "USE CASE",
      "article_link": "https://cointelegraph.com/news/whales-sybil-attacks-and-low-trust-can-daos-avoid-centralization-pitfalls",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "DeFi protocol Unizen to provide ‘immediate reimbursement’ after $2.1M hack",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/arbitrum-2-billion-vested-token-unlock",
        "name": "Ezra Reguerra"
      },
      "article_detailed_content": "Decentralized finance (DeFi) protocol Unizen announced that it would reimburse its users who lost 750,000 or less “as soon as humanly possible” after the platform got compromised, losing about $2.1 million in user funds.\nOn March 9, blockchain analytics firm PeckShield flagged an “approve issue” with the DeFi platform, reporting that over $2 million had already been drained. The security firm urged users to revoke the approvals from the trade aggregator to avoid further loss. Security company SlowMist estimated the exploit losses to be around $2.1 million and noted that the attacker swapped the Tether (USDT) for the stablecoin Dai (DAI).\nA day later, the DeFi protocol sent an on-chain message to the hacker, offering a 20% bounty in exchange for returning the remaining stolen funds. The protocol also said they are already working with law enforcement and forensic experts to determine the hacker’s identity.\nOn-chain message sent by Unizen to the hacker. Source: Etherscan\nWhile the bounty negotiations are still ongoing, the DeFi protocol was quick to refund victims of the hack. On March 11, the company announced it would make 99% of the affected users whole as soon as possible.\n“Reimbursement for the rest of those will be given to the same wallets affected starting immediately. While we intend to start distributions today, we are going through each distribution individually in a slow, careful and methodical manner,” they wrote.\nRelated: Crypto phishers stole $47M last month, impersonators on X to blame\nAccording to the announcement, Unizen founder and CEO Sean Noga loaned funds to the company to refund the hack victims. Users who lost below $750,000 will get their funds back, with refunds starting on March 11.\nThe company will return funds in USDT or USD Coin (USDC). However, for those who lost more than $750,000, the DeFi protocol said they would handle the issue on a case-to-case basis. Along with the announcement, the company also shared a video guide teaching users how to review and revoke approvals within the platform to avoid further losses. \nUnizen chief technology officer Martin Granström also said on X they have already collected enough evidence for a post-mortem report and are working with third-party firms on the matter. The executive announced that they would share an incident report soon and promised to invest more in security in the future.\nMagazine: DeFi’s billion-dollar secret: The insiders responsible for hacks",
      "article_summary": "DeFi protocol Unizen announced that it will issue an immediate refund to users who lost their funds to an exploit this weekend.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Security",
        "#Hackers",
        "#Cybersecurity",
        "#Hacks",
        "#DeFi"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/unizen-hack-immediate-refund",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Bitcoin halving: What’s different this time around?",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/bitcoin-all-time-high-new-millionaire-whale-wallets-lagging-kaiko",
        "name": "Brayden Lindrea"
      },
      "article_detailed_content": "Bitcoin’s supply and demand dynamic will be even more favorable than after previous halvings in 2012, 2016 and 2020, thanks to the recent launch of spot Bitcoin exchange-traded funds (ETFs) in the United States.\nBitcoin (BTC) halvings cut miner rewards in half every 210,000 blocks, which is approximately every 48 months.\nThe next halving event will occur at block 840,000 — expected to take place on April 20 — and will see mining rewards reduced from 6.25 BTC ($418,800) to 3.125 BTC ($209,400).\nHistory shows Bitcoin’s price starts ticking upward to break previous all-time highs about four or five months after the halving.\nOn May 11, 2020, during the previous halving, Bitcoin was priced at $8,750. It surged 430% five months later, from $11,500 to $61,300 by mid-March 2021.\nIn doing so, it smashed the previous all-time high of $19,665 on Dec. 16, 2017.\nBitcoin’s change in price between May 11, 2020 and March 15, 2021. Source: CoinGecko\nAnalysts have primarily attributed this to spot Bitcoin ETFs, which have caused a radical change in Bitcoin’s supply and demand dynamic, according to Jaran Mellerud, a founder and chief strategist at Hashlab Mining, who recently spoke with Cointelegraph.\nSpot Bitcoin ETF issuers are scooping up 2,450 BTC each day while only 900 BTC are mined, Mellerud noted.\n“This number will fall to 450 BTC post-halving in late April [where the ETFs will be] sweeping up BTC at a rate five times higher than BTC’s post-halving supply growth. This huge imbalance between supply and demand will lead to a continuous but volatile upward grind of the BTC price.”\nMellerud comments on Bitcoin’s supply and demand imbalance. Source: Jaran Mellerud on X\nThis will multiply Bitcoin’s demand at a time when the halving will reduce its supply, said Mellerud, who expects Bitcoin’s price to rise substantially higher as a result.\nSouce: Matt Hougan on X\nBitcoin is now more decentralized and secure\nThe health of the Bitcoin network has also strengthened, according to Mellerud, who noted that Bitcoin’s hash rate is five times higher than it was at the last halving.\n“It now requires five times more computing power and associated electricity supply, electrical infrastructure, and mining hardware to attack the network.”\nThe network was already tremendously secure at the time of the 2020 halving, but now it is basically impenetrable, Mellerud added.\nRelated: Bitcoin mining battles 2023 — Surging hash rates test industry limits\nMellerud noted that Bitcoin’s hash rate is now more widely distributed than at the time of the last halving, where Chinese miners controlled a large share of the network.\n“This geographic decentralization is continuing as miners migrate to Africa and Latin America to take advantage of cheaper electricity prices,” he said.\nSouce: Alex Gladstein on X\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd",
      "article_summary": "Fewer Bitcoin entering circulation after the halving will be met with increased demand from spot Bitcoin ETF issuers, leading to a “continuous, but volatile upward grind” in price, a mining analyst says.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Bitcoin",
        "#Blockchain",
        "#Mining",
        "#Bitcoin Mining",
        "#Halving",
        "#Bitcoin Halving"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/bitcoin-halving-different-this-time",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "A ‘simple’ hard fork could subvert a quantum attack on Ethereum: Vitalik Buterin",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/sec-radio-silence-ethereum-etf-not-a-good-sign-bloomberg-analyst",
        "name": "Tom Mitchelhill"
      },
      "article_detailed_content": "Ethereum is already “well-positioned” to mitigate the impact of a massive quantum computing attack on the network, according to Ethereum co-founder Vitalik Buterin.\nIn a March 9 post to Ethereum Research, Buterin discussed what would happen if a “quantum emergency” happened as early as tomorrow.\n“Suppose that it is announced tomorrow that quantum computers are available, and bad actors already have access to them and are able to use them to steal users’ funds,” Buterin postulated.\n“I argue that actually, we are already well-positioned to make a pretty simple recovery fork to deal with such a situation.”\n“The blockchain would have to hard fork and users would have to download new wallet software, but few users would lose their funds,” he added.\nButerin explained that the process of such a hard fork would involve rolling back the Ethereum network to the point where it is clear that “large-scale theft” was occurring and disabling all traditional transactions from that point.\nEthereum developers would then add a new transaction type — which forms part of the Ethereum Improvement Proposal (EIP) 7560 — to allow transactions from smart contract wallets.\nButerin’s breakdown of the EIP required to prevent a quantum-related exploit on Ethereum. Source: Ethereum Research\nWhen a user makes a transaction from their Ethereum wallet, the signature of that transaction reveals the public key, and in a “post-quantum world,” this would see the user’s private key revealed as well.\nThe new transaction type that forms the core part of the quantum-resist EIP would leverage Winternitz signatures and zero-knowledge proof technologies known as “STARKs” to ensure that existing wallets are switched to new validation code, he added.\nAn anonymous user shared an illustrated diagram of Buterin’s theoretical EIP. Source: Ethereum Research\nThis validation code leverages ERC-4337 account abstraction — the underlying technology of smart contract wallets — to prevent private keys from being displayed while signing transactions in the future, rendering these accounts immune from a quantum attack.\nRelated: Ethereum leans into rollup-centric future as Dencun hard fork looms\nAccording to Buterin, users who have never approved a transaction from an Ethereum wallet are “already safe” from any potential quantum-related exploit, as only the wallet address has ever been made publicly available.\nHe also added that the infrastructure needed to implement such as hard fork “could in principle start to be built tomorrow.”\nThe advent of quantum computing has been a long-feared inflection point for the crypto industry, as a computer capable of breaking blockchain encryption could see once-untouchable user funds stolen in large volumes and at rapid rates.\nHowever, most computer scientists and developers believe that quantum computing is still a ways off, with Google and IBM engineers estimating that quantum computing won’t be sufficiently developed until 2029 at the earliest.\nMagazine: Google to fix diversity-borked Gemini AI, ChatGPT goes insane: AI Eye",
      "article_summary": "The technology required to make Ethereum immune from a quantum attack could be developed starting “tomorrow,” said Buterin.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Security",
        "#Ethereum",
        "#Supercomputer",
        "#Fork",
        "#Hard Fork",
        "#Cybersecurity",
        "#Quantum Computing"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/simple-hard-fork-subvert-quantum-attack-ethereum-vitalik-buterin",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Binance exit sparks fears and opportunities in Nigeria’s crypto community",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/binance-exit-sparks-fears-and-opportunities-in-nigerias-crypto-community",
        "name": "Amaka Nwaokocha"
      },
      "article_detailed_content": "Local cryptocurrency stakeholders have lamented the current ban on Binance naira operations in Nigeria, stating it will affect the livelihoods of many Nigerians and could increase youth unemployment in the country.\nIn separate interviews with Cointelegraph, local crypto stakeholders said the delisting of Nigerian naira-related services from Binance will lead to the rise of new crypto exchanges, which will fill the vacuum created by Binance’s exit by complying with local regulations.\nNathaniel Luz, the CEO of Flincap — a liquidity platform for crypto exchanges — said that several Nigerian traders who make a living from trading peer-to-peer on Binance are now affected. However, Luz said that some are trading on WhatsApp and Telegram groups.\nAccording to the chief marketing officer of Flincap, Oladotun Wilfred Akangbe, the continuing uncertainty surrounding cryptocurrency regulation in Nigeria and the decision to halt Binance operations can undermine the confidence of many people in the space. He added that it could lead to massive fear, uncertainty and doubt in Nigeria’s crypto space.\nIn an official statement on its website, Binance said it would automatically convert naira balances to Tether (USDT) from March 8 at 8:00 am UTC and cease support for naira deposits from March 5 at 2:00 pm.\nWithdrawals have not been allowed since March 8 at 6:00 am, and the conversion rate is 1 USDT for 1,515.13 naira. Binance’s peer-to-peer platform delisted all naira trading pairs in late February.\nRelated: Binance temporarily suspends Solana network withdrawals, citing ‘increased volume’\nOn Feb. 27, the governor of the Central Bank of Nigeria argued that crypto exchanges in Nigeria were suspected of handling illicit transactions, pointing to “suspicious flows” of funds at Binance.\nAs the suspicions of Binance’s alleged illicit operations in Nigeria intensified, the Nigerian House of Representatives Committee on Financial Crimes called Binance CEO Richard Teng to appear before the committee before March 4.\nIn 2023, Nigeria’s Securities and Exchange Commission stated that Binance Nigeria wasn’t registered or regulated by it, making its operations in Nigeria illegal. In December 2023, the Central Bank of Nigeria reversed its stance on crypto assets, advising banks to ignore the previous ban on crypto transactions.\nMagazine: The DeFi bots pumping Solana’s stablecoin volume",
      "article_summary": "According to local crypto stakeholder Nathaniel Luz, Nigeria’s crypto ecosystem will see the rise of new crypto exchanges that will fill the vacuum created by Binance’s exit.",
      "creation_date": "2024-03-10",
      "associated_tags": [
        "#Blockchain",
        "#Cryptocurrencies",
        "#Government",
        "#Nigeria",
        "#Cryptocurrency Exchange",
        "#Tokens",
        "#Binance",
        "#Regulation"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/binance-exit-sparks-fears-and-opportunities-in-nigerias-crypto-community",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "MakerDAO implements temporary fee adjustments amid market volatility",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/binance-exit-sparks-fears-and-opportunities-in-nigerias-crypto-community",
        "name": "Amaka Nwaokocha"
      },
      "article_detailed_content": "MakerDAO, the organization responsible for the development of the Maker (MKR) token, has approved an “Executive Vote” to introduce temporary fee adjustments to strengthen the protocol due to heightened market volatility and bullish sentiment resulting in a reduction in reserves for its Dai (DAI) stablecoin.\nThe suggestion comes in response to a rapid decrease in the Dai supply from $5 billion to $4.4 billion in the last seven days, as outlined in the proposal from BA Labs, a member of Maker’s Stability Advisory Council.\nScreenshot of MakerDAO executive vote announcement on X. Source: MakerDAO\nIn the proposal, MakerDAO intends to expedite the approval process for a stablecoin stability measure if users choose to redeem a portion of the $1.1 billion in real-world assets (RWA) available on the protocol. Despite Dai being overcollateralized, using RWA vehicles as collateral poses potential liquidity issues if Dai’s selling continues.\n The proposal reads:\n“Liquid stablecoin reserves and reserves deployed to RWAs are more than sufficient to sustain the increasing pressure generated by the potential bullish market sentiment. The issue lies in the liquidity crunch inherent in the exposure toward stablecoins deployed through RWAs.” \nAlthough Maker DAO’s ecosystem is currently stable, it deems it necessary to anticipate potentially unpredictable user actions. The proposed measures include changes to Maker Vaults, the SparkLend DAI Borrow Rate, the Peg Stability Module (PSM), the Dai Savings Rate and the Governance Security Module (GSM) Pause Delay.\nRelated: Wyoming passes law granting DAOs legal status\nThe adjustments include raising the stability fees on different collateral assets registered on the platform from 15% to 17.25%. In addition, it plans to increase the SparkLend DAI Borrow annual percentage yield from the current 6.7% to 16%. The slate of changes was approved to go into effect from March 10 at 7:55 pm UTC.\nMakerDAO also plans to adjust the PSM to provide a cooldown for debt ceiling increases to drop from 24 to 12 hours. Other measures that will be implemented include incrementing the Dai Savings Rate to 15% and the GSM Pause Delay from 48 hours to 16 hours for swifter implementation of future adjustments.\nWhile these adjustments are temporary, there is no automatic process for reverting the fees. GFX Labs, a blockchain research and development company, expressed on the proposal’s discussion page that the changes were in the right direction but raised concerns about their magnitude, fearing potential market dislocations and disruptions.\nMagazine: Are DAOs overhyped and unworkable? Lessons from the front lines\nExchange or buy MKR\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd",
      "article_summary": "The adjustments include changes to Maker Vaults, SparkLend DAI Borrow Rate, the PSM, the Dai Savings Rate (DSR), and the Governance Security Module (GSM) Pause Delay.",
      "creation_date": "2024-03-10",
      "associated_tags": [
        "#Blockchain",
        "#Decentralization",
        "#DAO",
        "#DeFi",
        "#MakerDAO"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/makerdao-implements-temporary-fee-adjustments-amid-market-volatility",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Wyoming passes law granting DAOs legal status",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/arbitrum-dao-removes-proposal-fund-tornado-cash-devs",
        "name": "Ana Paula Pereira"
      },
      "article_detailed_content": "Wyoming Governor Mark Gordon has signed a bill into law establishing a legal framework for the formation and management of decentralized autonomous organizations (DAOs). \nThe bill was sponsored by the legislature’s Select Committee on Blockchain, Financial Technology and Digital Innovation Technology and introduces a legal status for decentralized unincorporated nonprofit associations (DUNAs) based in the state.\nThis is huge news for DAOs.\n\nRegistering as a DUNA legal entity will enable DAOs to engage in legal contracts with other entities and provide legal protection to individual DAO members. Other legal entities available to DAOs fall short on these metrics.\n\nLearn more from… https://t.co/j16Zr3xkw1\n— Ross Shuel | shuel.eth (@0xShuel) March 8, 2024\nThe document enacted on March 7 outlines the requirements for forming a DUNA, covers the roles of smart contracts and offers provisions over the legal responsibilities of the association and its members. According to the new law, a DUNA is a separate legal entity from its members, meaning that the DAO can be held liable without implicating its individual members. \n“A person is not liable for a breach of a decentralized unincorporated nonprofit association’s contract merely because the person is a member, administrator, authorized to participate in the management of the affairs of the nonprofit association or considered as a member by the nonprofit association.”\nA DAO is an entity with no central leadership. The decision-making process is bottom-up, with a community governed by a set of rules enforced by a blockchain. Giving a DAO legal existence enables a decentralized entity to establish contracts with third parties, open bank accounts, pay taxes and meet informational reporting requirements.\nNonprofit status\nIn an analysis on March 8, venture capital firm a16z crypto asserted that there is a “fundamental misunderstanding of the nonprofit designation provided by the new law.\nAccording to Miles Jennings, a16z’s general counsel, and David Kerr, principal at Cowrie law firm, a Wyoming-based DAO is not prohibited from engaging in for-profit activities.\n“Under Wyoming law, both the UNA and the DUNA are able to engage in for-profit activities. This would include the operation of a decentralized exchange protocol, a decentralized social media protocol, you name it.”\nDAOs are also allowed to pay compensation to their members, including in exchange for participation in the governance process, reads the analysis. “Wyoming’s approach supports the web3 ethos, while still enabling cash flows to digital asset holders. This is a significant breakthrough.”\nMagazine: Are DAOs overhyped and unworkable? Lessons from the front lines",
      "article_summary": "The new regulation enables decentralized autonomous organizations to establish contracts with third parties, open bank accounts, pay taxes and provide liability protection to its members.",
      "creation_date": "2024-03-08",
      "associated_tags": [
        "#Blockchain",
        "#Law",
        "#Business",
        "#DAO",
        "#United States"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/wyoming-passes-law-granting-dao-legal-status",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "TCG World partners with Chooky Records to bring Busta Rhymes, others to the metaverse",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/futureverse-studios-debuts-trailer-web3-readyverse-battle-royale-game",
        "name": "Tristan Greene"
      },
      "article_detailed_content": "TCG World, an online virtual community sandbox, recently partnered with Chooky Records, a blockchain music label, to bring hit music from O.T., Elesia Iimura and Busta Rhymes to the metaverse.\nThe first product of the two companies’ collaboration will be the official launch of the hit recording artists’ “Chooky” video to the TCG World metaverse. According to a press release from TCG World, this marks the animated video’s first appearance in the metaverse at large.\nSource: @OfficialTCGCoin on X.\nAs Cointelegraph reported, TCG World launched in 2021 as a metaverse featuring virtual real estate, Web3 collectibles, and a landscape where pretty much everything could be traded as a nonfungible token (NFT). At the time of its launch, it claimed to be the first 4K VR low poly game and the largest on the BNB Smart Chain blockchain.\nChooky Records is a nontraditional record label that combines digital music with NFTs to create hybrid, tokenized entertainment experiences. It found success in 2023 when the song “Chooky,” by Nigerian recording artist O.T. and Australian/Japanese artist Elesia Iimura became a viral hit.\nBusta Rhymes, a platinum-selling recording artist whose legendary career has produced hit songs in five different decades — including his critically praised appearance on A Tribe Called Quest’s seminal hip hop track “Scenario” — lent his vocals and likeness to the “Chooky” track for its November 2023 audio visualization and the TCG World metaverse experience. \nWhile Chooky Records is a relative newcomer to the independent music scene, its infrastructure has garnered praise throughout the music community. According to the Chooky Records white paper:\n“Chooky allows for artists to not be confined in 360 deals with one off contracts, higher % entitlement to royalties, a high % split from the royalty sharing NFTs, event management, promotion, access to high caliber marketing resources and introductions to some of the most high-profile artists in the industry.”\nRelated: What’s the missing piece for mainstream Web3 adoption?",
      "article_summary": "The legendary hip hop artist who once rapped on A Tribe Called Quest’s seminal hit “Scenario” is now in the metaverse.",
      "creation_date": "2024-03-08",
      "associated_tags": [
        "#Blockchain",
        "#Music",
        "#Metaverse",
        "#NFT"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/tcg-world-partners-chooky-records-nft-web3-busta-rhymes-metaverse",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "ShapeShift settles pre-DAO SEC case, Uniswap hits 2-year high: Finance Redefined",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/shapeshift-settles-pre-dao-sec-case-uniswap-hits-2-year-high-finance-redefined",
        "name": "Prashant Jha"
      },
      "article_detailed_content": "Cryptocurrency exchange ShapeShift has settled a lawsuit with the United States Securities and Exchange Commission (SEC). The case dates back to 2021, before it became a decentralized autonomous organization (DAO).\nUniswap’s (UNI) token blasted to two-year highs amid the marketwide bullish surge, and Solana proponents believe it needs a breakthrough consumer app to rival the Ethereum network.\nExperts weigh in on how pump-and-dump schemes harm the crypto industry, and the total value locked (TVL) in DeFi crosses $100 billion for the first time in three years.\nSolana needs Firedancer, “ChatGPT moment” to rival ETH, proponents say\nA major upgrade on Solana aimed at increasing transaction processing in 2024, paired with a potential breakthrough consumer app, could be all that’s needed for Solana to finally live up to its moniker as an “Ethereum killer.”\nThat’s what Solana’s proponents believe amid a fresh wave of on-chain activity, increasing developer count and a growing number of users, boosted partly by a memecoin-led resurgence in December 2023.\nContinue reading\nDeFi pump-and-dump schemes rake in millions, harm industry credibility\nThe cryptocurrency space is often compared to the Wild West, and while it has been maturing to resemble the world of traditional finance more closely, in the DeFi space, the “wild” ethos remains, with freewheeling trading activity often leading to pump-and-dump schemes and wash trading.\nPump-and-dump schemes usually consist of an actor or group of actors manipulating investors with false claims, excitement and fear of missing out to make them buy tokens. At the same time, they covertly dump their stakes at higher prices.\nContinue reading\nUniswap hits two-year high as fee share proposal deadline approaches\nUniswap’s UNI, the governance token of the Uniswap DEX, has rallied 46% to trade above $17, levels last seen in January 2022.\nUNI’s performance is accompanied by a 120% leap in trading volume over the last 24 hours to $1.18 billion. Its market capitalization has increased by 44% over the past week to $9.4 billion, making it the 16th-largest cryptocurrency by market capitalization.\nContinue reading\nShapeShift settles SEC securities charges dating to its pre-DAO days\nCryptocurrency exchange ShapeShift submitted a settlement offer to the SEC, accepting the agency’s cease and desist order and agreeing to pay a penalty. The exchange ceased the operations in question in 2021 when the exchange converted into a DAO.\nAccording to SEC allegations, ShapeShift operated an online platform structured as a crypto “vending machine” from 2014 to January 2021. ShapeShift served as the “market maker” and counterparty for the trades, enabling it to generate revenue on the price spread of trades.\nContinue reading\nDeFi market overview\nData from Cointelegraph Markets Pro and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bullish week, with most trading in the green on the weekly charts. The TVL in DeFi protocols breached $100 billion for the first time in three years.\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.",
      "article_summary": "Amid a marketwide bullish run, Uniswap’s UNI token has reached a new two-year high.",
      "creation_date": "2024-03-08",
      "associated_tags": [
        "#Blockchain",
        "#Cryptocurrencies",
        "#Business",
        "#DeFi",
        "#Uniswap",
        "#DEX"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/shapeshift-settles-pre-dao-sec-case-uniswap-hits-2-year-high-finance-redefined",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "What’s the missing piece for mainstream Web3 adoption?",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/music-nfts-can-reshape-the-indie-music-industry-heres-how",
        "name": "Janina Winter"
      },
      "article_detailed_content": "Web3’s growth presents challenges for newcomers who find navigating various subsectors and DApps confusing. A unified platform would simplify the onboarding process, enhancing clarity and promoting faster adoption of Web3 use cases.\nWeb3, encompassing decentralized finance (DeFi), blockchain gaming, and digital currencies, is rapidly evolving. However, its fragmented nature mirrors the chaos of the early internet before the dot-com bubble. The lack of interoperability between decentralized networks and poor communication across different Web3 sectors contribute to this disarray.\nToday’s Web3 lacks a unifying ecosystem, causing the market to fracture into multiple, independently evolving use cases. Crypto enthusiasts have to use various decentralized applications (DApps) and platforms to perform multiple transactions and interact with the different sectors of Web3. However, this isn’t a sustainable growth model for the Web3 industry and is more of a deterrent rather than a benefit when it comes to crypto adoption.\nA one-stop shop platform could be a good start for beginners who can try various Web3 use cases from a single starting point. Such a unified experience would provide clarity and a smooth gateway to the Web3 world, acting as a Google-like aggregator for these diverse sectors.\nThe rise of super apps in Web3\nRecognizing the need for a more integrated approach, some Web3 players are moving beyond the hype. Legion Network is emerging as a notable example among these. As a one-stop shop for Web3, Legion Network addresses the complexity of the industry and reaches new audiences. It brings together essential Web3 use cases, including a proprietary crypto wallet with comprehensive portfolio tracking, DeFi swaps and bridges, engaging play-to-earn/win games, captivating quests with prize rewards, a launchpad for emerging projects and a unique SocialFi experience that fosters community engagement.\nUsers can download Legion's super app, which is available on the App Store and the Google Play Store. The app has grown significantly since its launch, with over 5 million downloads, an average rating of 4.2 stars from 215,000 reviews, and nearly 500 million game plays. These metrics underscore the app’s popularity and effectiveness in engaging and retaining a diverse user base.\nHere’s a detailed breakdown of the key features that distinguish Legion Network in the Web3 landscape:\nCrypto wallet and asset management: Legion Network offers a fully noncustodial wallet supporting over 15,000 tokens across over 40 blockchains. It allows seamless integration with decentralized exchanges (DEXs) for swapping and bridging and provides features for crypto portfolio tracking and display for nonfungible tokens (NFTs), focusing on user security and ease of use.\nStaking program and Bolts system: Legion Network’s innovative staking program exemplifies their commitment to a sustainable ecosystem. It rewards users with increased access to services based on their staking level, promoting a more active and engaged community.\nMoreover, Legion Network has effectively gamified every aspect of its app. Through Bolts, users earn rewards for their interactions, allowing them to unlock perks across all services. This approach ensures equitable access to the app’s features, regardless of users’ ability to make in-app purchases.\nPlay-to-earn/win games and quests: Gaming and quests are integral to the Legion experience, aligning with the play-to-earn and play-to-win models. Users can complete tasks and quests to win prizes and rewards, sometimes in collaboration with partners.\nThis gamification extends throughout the app with the SocialFi aspect and a raffle system where users can use Bolts earned from platform engagement to enter and win prizes, underscoring the Legion Network ecosystem’s emphasis on gamification.\nLaunchpad for emerging projects: Legion Network’s launchpad introduces users to new blockchain projects, fostering innovation within the Web3 space.\nLearning hub: Integral to Legion’s super app is Empower Academy, a comprehensive learning experience centered around blockchain technology, cryptocurrencies and various aspects of the Legion Network ecosystem. The educational platform offers CPD-certified courses and a unique earn-while-you-learn system.\nPersonalized user experience and community building: Legion enhances user engagement by allowing customization of profiles and showcasing NFT collections, staking ranks and wallet stats. The Ambassador Program and the new Groups and Clans feature foster deeper community connections.\nLegion Network’s Bluemoon, a social metaverse with NFT marketplace integrations, prioritizes immersive experiences. The platform caters to creators and businesses, providing a user-friendly infrastructure to build custom metaverse spaces while seamlessly facilitating NFT trading all within a single platform.\nIs a super app the future of Web3?\nThanks to a combination of all major blockchain and Web3 elements, including DeFi, NFTs, gaming, cryptocurrencies, social and the metaverse, Legion Network aims to create an easy access point for everyone new to crypto space and transit users from a Web2 to a Web3 mindset.\nLearn more about Legion Network\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.",
      "article_summary": "Web3 has been growing fast, but the fragmented industry still hinders mainstream adoption.",
      "creation_date": "2024-03-08",
      "associated_tags": [
        "#Blockchain",
        "#Adoption",
        "#Metaverse",
        "#DeFi",
        "#Web3"
      ],
      "category": "USE CASE",
      "article_link": "https://cointelegraph.com/news/whats-the-missing-piece-for-mainstream-web3-adoption",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Arbitrum DAO votes on $1M fund for Tornado Cash devs' legal defense",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/arbitrum-dao-removes-proposal-fund-tornado-cash-devs",
        "name": "Ana Paula Pereira"
      },
      "article_detailed_content": "The Arbitrum DAO is voting to fund the legal defense costs of Tornado Cash’s developers. If approved, the community would donate up to 600,000 ARB tokens in the first year, worth nearly $1.3 million at the time of writing. \nA proposal submitted on March 7 by pseudonymous delegate DK seeks to fund a “robust legal defense” for Roman Storm and Alexey Pertsev, the developers behind the crypto mixer Tornado Cash. In addition, the funds could be used for public relations and advocacy efforts promoting awareness around privacy-preserving technologies and legal burdens for developers.\n“By rallying support for their legal fund, we aim to safeguard not only the future of privacy-preserving technologies but also the broader principles of innovation, decentralization, and individual sovereignty within our industry.”\nThe proposal sets three tiers for voting under different funding levels, ranging from 200,000 to 600,000 ARB. To date, more than 80% of the votes have been cast for the highest tier. The deadline for voting is March 14.\nThe accusations against Tornado Cash and its founders revolve around the platform’s alleged role in laundering over $1 billion in illicit funds, including money linked to the North Korean hacking organization Lazarus Group. As a result, Tornado Cash has been subject to significant legal actions, including its addition to the United States sanctions lists, effectively banning residents in the country from using the service and sparking controversy within the cryptocurrency community.\nProposal open for vote\nSupporters of Tornado Cash argue that the platform merely provides software for decentralized money transmission and does not directly engage in money transmission itself, which challenges the basis of the charges against its developers. According to the crypto advocacy group Coin Center, the Financial Crimes Enforcement Network (FinCEN) guidelines state that an anonymizing software provider should not be considered a money transmitter.\nStorm and Pertsev face several charges from U.S. authorities, including conspiracy to commit money laundering, conspiracy to commit sanctions violations, and conspiracy to operate an unlicensed money-transmitting business.\nThe first two charges can each carry a maximum sentence of 20 years in prison, while the charge for operating an unlicensed money-transmitting business is punishable by up to five years in prison.\n“These [legal] challenges not only threaten the developers’ ability to continue their work but also undermine the fundamental principles of decentralization and individual freedom upon which projects with privacy-preserving technologies are built.”\nThe community proposal comes just a few days after the crowdfunding platform GoFundMe canceled a fundraiser dedicated to collecting legal fees for Storm and Pertsev, citing a breach of their terms of service that could “expose GoFundMe, its employees or Users to any harm or liability of any type.”\nMagazine: Tornado Cash 2.0 — The race to build safe and legal coin mixers\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nA weekly summary of the latest news in crypto legislation and regulations. Delivered every Monday\nSubscribe\nBy subscribing, you agree to our Terms of Services and Privacy Policy",
      "article_summary": "The Arbitrum community is voting on a proposal to fund a “robust legal defense” for Tornado Cash developers Roman Storm and Alexey Pertsev.",
      "creation_date": "2024-03-08",
      "associated_tags": [
        "#Blockchain",
        "#United States",
        "#Regulation",
        "#Tornado Cash"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/arbitrum-dao-vote-1-million-fund-tornado-cash-devs-legal-defense",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Lowering developer friction is key for mass-scaling blockchain applications — Polygon co-founder",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/btc-71k-same-20k-previous-cycle-btc-analysis",
        "name": "Zoltan Vardai"
      },
      "article_detailed_content": "Building blockchain infrastructure that attracts developers is key for mass scaling blockchain applications, Anurag Arjun, the founder of Avail and co-founder of Polygon, told Cointelegraph in an exclusive interview on March 7.\n“Lowering developer friction is very important. If you look at the first mobile apps that were built when the initial infrastructure came out, those were very simplistic sort of apps. It took a lot of years of experimentation to build something like Uber or Instagram.”\nArjun added that building developer-focused scaling solutions like layer-2 rollups will be necessary to advance blockchain-based decentralized applications (DApps). He said:\n“The real utility of [scaling solutions] is if developers can quickly work with this infrastructure to actually create useful scale apps that go mainstream, for example, right again right now.”\nAverage monthly active developers decreased 24% to 22,411 in 2023, compared to 2022, according to a Jan. 17 report by Electric Capital. The firm attributes this drop to a record number of new developers who joined in 2022. The report notes:\n“While developers overall are down 24%, the most valuable segment of developers (2+ year tenure who contribute the most code) continues to steadily grow.”\nWhen asked about the future of blockchain scalability, Arjun said that he expects to see hundreds of application-specific rollups that will be united under a user experience-friendly app layer, much like today’s Web2 shopping experiences that simplify online purchases.\n“When you click on the buy button on [Amazon], it opens up a payment page, but the user doesn’t know all the complexity behind the process,” said Arjun, adding that Web3 infrastructure will need to simplify the user experience in a similar way to attract more mainstream users.\nArjun is also the co-founder of Web3 data availability and consensus layer, Avail, which closed a $27 million seed funding round on Feb. 26, led by Founders Fund and Dragonfly.\nThe funds will be deployed to help accelerate the unification of Web3 by bolstering the developments of the firm’s three core products, also known as the “Avail Trinity:” the data availability layer, the nexus unification layer and the fusion security layer.\nRelated: Ethena becomes highest earning DApp in crypto\nExchange or buy MATIC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd",
      "article_summary": "Building developer-centric scaling solutions is key for the next “breakout” blockchain app, Polygon’s Anurag Arjun told Cointelegraph.",
      "creation_date": "2024-03-08",
      "associated_tags": [
        "#Blockchain",
        "#Adoption",
        "#Scalability",
        "#DeFi",
        "#zk-Rollup"
      ],
      "category": "INTERVIEW",
      "article_link": "https://cointelegraph.com/news/lowering-friction-key-mass-scaling-blockchain-polygon-founder",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "What do Bitcoin’s all-time highs mean for crypto industry expectations in 2024?",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/what-bitcoin-s-all-time-highs-mean-expectations-2024",
        "name": "Ray Salmond"
      },
      "article_detailed_content": "The long-awaited Bitcoin (BTC) price all-time high finally happened on March 5 after the world’s first cryptocurrency rallied above $69,000. \nAnd there we have it. We are officially in a bull market.\nDuring the last bull market, developers, projects and artists all shared their lofty goals and ideas of how crypto and blockchain would revolutionize the entire world. While some of that happened, in reality, a lot was left unachieved.\nSo, now that market conditions have finally improved, everyone has another chance at delivering on what was promised. The Agenda co-hosts Jonathan DeYoung and Ray Salmond’s assumption is that with better market conditions and profitable balance sheets, blockchain projects should have sufficient runway to build the products and services that hope to solve a lot of the world’s problems.\nOn episode 31 of The Agenda, Salmond and DeYoung share their views on the significance of Bitcoin’s price hitting a new all-time high and what this could mean for crypto in 2024.\nBitcoin’s phoenix moment is a sign of a maturing asset and market\nOnce one gets past the excitement and fixation surrounding Bitcoin hitting new all-time price highs, a more contemplative mood sets in, wherein the significance of the milestone is considered.\nWhen asked about what BTC price going to the moon means in the larger scheme of things, Salmond suggested that it is “a sign of maturity,” especially considering that:\n“The ETFs are kind of like buyers of infinite demand, right? They’re like purchasers of infinite demand. Every day for the last two or three weeks, they’ve been buying $500 million minimum of Bitcoin daily, or $450 million daily. Even today, as Bitcoin price sold off after hitting a new all-time high, ETFs like IBIT from BlackRock traded like 1 billion shares.”\nDeYoung expressed his perspective that, unlike previous bull markets, social chatter from non-crypto bros pales in comparison to what was seen in 2017 and 2020 and that he found himself somewhat surprised not to be looking at his portfolio value every five minutes:\n“I’m here for something deeper. So yeah, now that the price is back, I feel like I’m a bit detached from that. And I also think that we’re just — I mean, you can correct me if you disagree — but I feel like we’re just still so early into this bull run that I feel like getting super hyped up about hitting $69,000 is a bit premature, I guess.”\n2024 will be more about results than ideas\nSalmond and DeYoung agreed that in 2024, blockchain and crypto’s success is more likely to be defined by builders’ ability to deliver useful products and services instead of the value of their tokens. DeYoung said:\n“I hope that it means that some of the people that are riding the wave up will then take some of their money and throw it into the more passion projects. Like they made their money with the [...] hype plays, maybe the bigger projects that make a little cash. Now they’ve got an extra few ETH lying around, and they can throw it into their friend’s passion project and help that get off the ground, or the kind of cool, unique use cases.”\nDeYoung suggested that the synergy between crypto and artificial intelligence will continue to strengthen as the need to verify data and media becomes more necessary. According to DeYoung, blockchains seem perfectly purposed for cataloging and authenticating data, and he expects that they will play a critical role in media and possibly in government in the coming years.\nRelated: Bitcoin accumulation phase ends as ETFs fuel new $100K BTC price target\nSalmond, on the other hand, is hopeful that music nonfungible tokens (NFTs) will become a trendy industry again in 2024:\n“You know, the market blew up two years ago. So, I thought the phoenix of NFTs would be music NFTs. I really thought that that was the one kind of subsector of the industry that made the most sense and would have the most growth — it would just be easy to kind of bridge between Web3, blockchain and the traditional music industry. And there were so many platforms and people that were fundraising to the tune of tens of millions of dollars for music NFTs that I’m surprised nothing has happened.”\nSalmond conceded that perhaps the timing of his high expectations lack patience, something that he explained is critical in the fintech space:\n“One thing I’ve learned investing in Ethereum, Bitcoin maybe, but really Ethereum and some of the other, Ethereum-like coins — one thing I’ve learned about tech companies is you don’t expect results at the end of one year, or even at the end of two years, or even at the end of three years. You expect the payoff and the result at the end of five or 10 years. Like ETH is clearly a five-to-10-year investment.”\nTo hear more from Jonathan and Ray’s conversation on The Agenda — including juicy details about upcoming episode guests — listen to the full episode on Cointelegraph’s Podcasts page, Apple Podcasts or Spotify. And don’t forget to check out Cointelegraph’s full lineup of other shows!\nMagazine: Is measuring blockchain transactions per second (TPS) stupid in 2024? Big Questions\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.",
      "article_summary": "We’re in a bull market. Now what? Jonathan and Ray share their thoughts, ideas and expectations for the crypto market in 2024.",
      "creation_date": "2024-03-08",
      "associated_tags": [
        "#Blockchain",
        "#Cryptocurrencies",
        "#Bitcoin Price",
        "#SEC",
        "#ETF",
        "#Adoption",
        "#Podcast",
        "#Web3",
        "#NFT",
        "#The Agenda"
      ],
      "category": "PODCAST",
      "article_link": "https://cointelegraph.com/news/what-bitcoin-s-all-time-highs-mean-expectations-2024",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Optimism offloads $90M worth of tokens in private deal",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/arbitrum-2-billion-vested-token-unlock",
        "name": "Ezra Reguerra"
      },
      "article_detailed_content": "Optimism Foundation — the organization behind the Ethereum layer-2 blockchain Optimism — announced a private sale of about 19.5 million of its governance tokens. \nOptimism (OP) tokens are worth about $4.62 on the market, making the number of tokens sold worth around $90 million at the time of writing. While the foundation is offloading a large number of tokens, it mentioned in the announcement that the sale included a vesting period of two years, prohibiting the buyer from selling the tokens before then.\nWithin the vesting period, the Optimism Foundation highlighted that the buyer can still use the tokens for governance participation. The foundation wrote:\n“During the lock-up, the purchaser will be able to delegate the tokens to unaffiliated third parties for participation in governance.”\nThe organization also explained that the tokens were from an “unallocated portion of the OP token treasury.” The foundation said these assets are part of the organization’s original working budget, which is 30% of the initial OP token supply.\nThe foundation informed the community that the OP tokens will be sent in several transactions in the coming days. Optimism assured the community that these were planned transactions, suggesting they were the tokens sold in the private sale.\nRelated: $900M in vested tokens set to be released in February\nOptimism did not disclose the details of the sale or the buyer, as the transaction was private. This sparked some discussions on X, with some viewing the sale negatively while others defended the foundation.\nEthereum advocate Anthony Sassano said that while he loves Optimism and has invested in it, private sales without transparency leave “a bad taste” in his mouth. Meanwhile, other community members argued that the team behind Optimism has to earn a living, too.\nCommunity members discussing the Optimism private sale. Source: 0xBoboShanti on X.\nThis is not the first time Optimism has conducted a private sale of its tokens. On Sept. 21, 2023, the network transferred 116 million OP tokens, worth about $160 million at the time, after a private sale it conducted.\nAt the time, some observers feared the sale would affect prices negatively. However, the tokens were also subjected to a two-year lockup, meaning they did not immediately impact the token’s price.\nMagazine: Zhu Su pumps Milady to $19K, Alchemy Pay crypto bank, HK tokens: Asia Express",
      "article_summary": "Optimism also sold 116 million OP tokens in another private sale held back in September 2023.",
      "creation_date": "2024-03-08",
      "associated_tags": [
        "#Blockchain",
        "#Ethereum",
        "#Layer2",
        "#Governance Token"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/optimism-offloads-tokens-private-deal",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Cloud-based app taps into Solana to bring life to old devices",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/microstrategy-buys-800m-bitcoin",
        "name": "Gareth Jenkinson"
      },
      "article_detailed_content": "Mobile device users in emerging economies and those hampered by outdated hardware could tap into a new virtual smartphone application running on Solana’s blockchain and decentralized cloud infrastructure.\nAphone debuted in the Solana ecosystem on March 7 as a web-based virtual smartphone that gives users access to various Web3 and conventional applications. APhone ecosystem development and growth lead Jennifer Booze unpacked details of the service in correspondence with Cointelegraph following its launch.\nCointelegraph tested Aphone’s virtual device, which features several Web3 DApps and conventional mobile applications. Source: Aphone\nAphone looks and feels like an Android smartphone and is platform-agnostic, meaning it can operate on a browser, Android or Apple device. Booze says it functions more like an operating system with its interface, features and underlying technology rather than replacing a device’s operating system.\n“It’s a cloud smartphone environment that users can access through their current devices, leveraging decentralized cloud computing to run Web3 applications smoothly without needing local hardware upgrades,” Booze explains.\nThe team envisions the virtual device as a means of onboarding users to Web3 applications and protocols previously hindered by the hardware limitations of devices.\nRelated: Solana Saga fetches up to $5K on eBay as Bonk frenzy causes sell-out\nAphone’s service bypasses the hardware limits of older smartphone models by operating on a decentralized cloud-based graphics processing unit (GPU) computing infrastructure, Aethir. Aphone’s interface and its applications run on the cloud service, which allows users to access apps and games that the physical device would not be able to handle.\nBooze said the virtual device’s primary use case is to drive access to the broader Web3 ecosystem as smartphones become increasingly ubiquitous in emerging markets alongside the proliferation of mobile internet access.\n“By leveraging Aethir’s decentralized cloud technology, APhone enables these users to experience advanced Web3 applications, NFTs, DeFi platforms, blockchain games and run multiple smartphones on a single device.”\nThe virtual alternative to buying a new smartphone will cost users $20 a year. Prospective users can buy an Aphone nonfungible token (NFT), which is minted and burned on the Solana blockchain, giving users access to the virtual device.\nThe device will also provide access to several decentralized physical infrastructure networks (DePIN) operating on Solana. This includes Helium, which rewards users for providing network coverage and validating transactions.\nRelated: ‘107,000 GPUs on the waitlist’ — Io.net beta launch attracts data centers, GPU clusters\nCointelegraph asked why Aphone needs to operate on blockchain infrastructure and the purpose of its native PHONE token. Booze said that operating on Solana offers high transaction speeds, lower costs and enhanced security and decentralization.\n“These features support a seamless Web3 experience, including managing NFTs, tokens, and accessing DApps. Aethir’s infrastructure enables the powerful processing capabilities required for demanding Web3 applications, making the integration of blockchain technology essential for APhone’s operation,” Booze adds.\nThe device’s native token is set to be used for governance and rewards incentivization mechanisms to drive user engagement and participation.\nAs Cointelegraph previously explored, DePINs are making their mark as resources to power artificial intelligence tools, which are becoming increasingly valuable. Recently developed DePIN platform IO.net will allow users to source GPU computing power for AI and machine learning, with Solana’s blockchain used to process and facilitate millions of microtransactions to data centers and hardware providers.\nMagazine: The DeFi bots pumping Solana’s stablecoin volume\nExchange or buy SOL\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd",
      "article_summary": "A new virtual smartphone application has launched on Solana’s blockchain and Aethir’s decentralized cloud infrastructure aimed at users with outdated hardware and those in emerging economies.",
      "creation_date": "2024-03-08",
      "associated_tags": [
        "#Blockchain",
        "#Adoption",
        "#Smartphone",
        "#Cloud Services",
        "#mobile tech",
        "#GPU",
        "#Solana"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/virtual-smartphone-launches-solana",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Metaverses could be a hub for distributing copyrighted work illegally — UK researchers",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/arbitrum-2-billion-vested-token-unlock",
        "name": "Ezra Reguerra"
      },
      "article_detailed_content": "Researchers in the United Kingdom have studied the viability of current intellectual property (IP) laws and their application to new technologies like the metaverse. In the study, the researchers identified the shortcomings of existing laws and presented their recommendations. \nOn March 7, the U.K. government published an externally commissioned research report titled “IP and Metaverse.” The report dove into the existing literature on IP laws and how they can apply to the metaverse. Within the study, the researchers concluded that there are metaverse-specific IP issues, such as IP governance in an interoperable environment and regulating technologies like the blockchain and artificial intelligence (AI) within virtual worlds.\nAccording to the report, many legal challenges come with interoperability, including the unauthorized dissemination of copyrighted work. The researchers highlighted that the lack of interoperability has been important in preventing people from illegally distributing copyrighted material. With interoperability being a key feature in a metaverse, the researchers believe this could pose a challenge in governing the use and circulation of copyrighted work.\nMeanwhile, blockchain’s inherent characteristics, such as immutability or being “tamper-proof,” also pose a challenge to enforcing IP laws. The researchers wrote:\n“Blockchain’s inherent resistance to change or correction undermines the ability to flexibly manage or update IP rights. This is an issue which becomes especially worrisome in the context of ownership disputes, as well as for navigating the termination of agreements and rights if licensors or rightholders seek to leave the Metaverse.”\nHowever, AI use in the potential metaverse governance of IP also poses some anticipated challenges. The researchers argued that algorithmic management of infringements is “extremely vulnerable to misuse” because of the absence of human oversight to guarantee the legitimacy of enforcement.\nRelated: Majority of social media posts about metaverse show positive sentiment\nApart from this, AI-generated content also brings up another challenge for IP enforcement in the metaverse. According to the study, reliance on AI tools has the potential to invalidate claims of inventorship in content. The research highlighted examples and cases that showed that “only works partially assisted by AI” are able to be protected by IP laws.\nBecause of the anticipated issues in IP governance within the metaverse, the researchers concluded that there’s a need for clarity on a “plethora of key issues.” This includes legal issues on copyrights, trademarks, patents, designs, user-generated content, virtual property and nonfungible tokens (NFTs) within the metaverse. Because of this, the researchers believed that it’s necessary to formulate IP approaches for addressing governance and enforcement issues for a metaverse.\nMagazine: Doctor Who materializes in Web3: Tony Pearce’s journey in time and space\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nA weekly summary of the latest news in crypto legislation and regulations. Delivered every Monday\nSubscribe\nBy subscribing, you agree to our Terms of Services and Privacy Policy",
      "article_summary": "Researchers concluded that it is necessary to formulate approaches for addressing the enforcement and governance of IP issues in the metaverse.",
      "creation_date": "2024-03-08",
      "associated_tags": [
        "#Blockchain",
        "#Law",
        "#United Kingdom",
        "#AI",
        "#Metaverse"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/metaverse-intellectual-property-challenges-uk-researchers",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "AI tokens are more hype than value right now, says Coinbase analyst",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/india-earmarks-1-25-b-ai-growth",
        "name": "Arijit Sarkar"
      },
      "article_detailed_content": "While technologists continue to explore artificial intelligence (AI) use cases in all business verticals, a Coinbase research report suggests that AI-related tokens may be over-hyped right now, at least in the short and medium term. \nThe rising popularity of generative AI spurred niche crypto sub-ecosystems over the last couple of years. However, Coinbase research analyst David Han believes that the rapid changes in AI “make us cautious” of the long-term sustainability of most AI tokens.\nOne of the primary challenges with crypto AI projects lies within the core of both technologies. While crypto projects often aim for decentralization, the current AI offering relies heavily on centralized components and data sources, argues Han.\nIn addition, most projects in the niche have failed to attract investors — resulting in under-indexed capital allocation.\nThe report highlights two opportunities for the crypto AI ecosystem — improving the blockchain data for creating human-readable transactions and analysis and helping decentralize the predominantly centralized AI infrastructure. However, Han said:\n“A decentralized AI future, as it is currently envisioned by many in the crypto industry, is not guaranteed — in fact, the future of the AI industry itself is still largely undetermined.”\nDespite the negative outlook, many AI tokens haverecently outperformed Bitcoin (BTC) and major stocks such as Nvidia and Microsoft. Coinbase attributed this to the market sentiment built by the broader crypto market and supported by related AI news headlines.\nAI tokens have a wide distribution of returns on days where BTC traded negatively. Source: coinbase.bynder.com\nThe crypto AI narrative could grow even stronger amid the continued constructive crypto market and the outperforming AI sector. However, Coinbase suggests that driving “meaningful adoption” will require more than just decentralizing AI components.\nIt is important to note that the AI ecosystem is currently in its nascency and will have to “understand the underlying trading narrative” at the very least, eventually providing a comparable alternative to today’s crypto assets.\nRelated: Coinbase shares climb after-hours as exchange fixes site jitters\nComplimenting Coinbase’s suggestion for meaningful developments in the crypto AI sphere, Ethereum co-founder Vitalik Buterin recently said AI could becrucial to eradicating bugs buried deep within its code.\nEthereum co-founder Vitalik Buterin shares optimism about using AI to fix blockchain bugs. Source: Vitalik Buterin on X\nOn Feb. 19, Buterin shared his excitement for AI-powered auditing to identify and fix buggy code in the Ethereum network, describing it as the “biggest technical risk” to the network.\nAI tokens cumulatively hold a market capitalization of $51.18 billion as of March 8, according to Crypto.com data. These tokens serve AI-based projects, applications and services, such as decentralized AI marketplaces, AI-powered trading algorithms and AI-driven decentralized autonomous organizations, to name a few. \nMagazine: Is measuring blockchain transactions per second (TPS) stupid in 2024? Big Questions\nExplore more articles like this\nSubscribe to the Markets Outlook newsletter\nWeekly newsletter that covers the main factors influencing Bitcoin’s price and the week ahead. Delivered every Monday\nSubscribe\nBy subscribing, you agree to our Terms of Services and Privacy Policy",
      "article_summary": "While some crypto-AI tokens continue to deliver profitable trades, the long-term sustainability of the ecosystem will require more than just decentralizing AI components.",
      "creation_date": "2024-03-08",
      "associated_tags": [
        "#Blockchain",
        "#Coinbase",
        "#Decentralization",
        "#AI",
        "#Tokens",
        "#Tokenomics"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/crypto-ai-tokens-value-overstated-coinbase-research",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Web3 social app tackles fake accounts with an innovative engagement system",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/noncustodial-lending-and-crypto-debit-card-with-finma-compliance-launches",
        "name": "Nihatcan Yanik"
      },
      "article_detailed_content": "Rising concerns over fake accounts and bots on social media platforms have underscored the limitations of Web2 technologies. Phaver introduces a Web3 social app with a gamified system to combat botting and incentivize genuine user engagement.\nSocial media has a fake account problem, and a 2018 survey highlighted a growing concern among parents of teens — with over 65% alarmed by fake accounts and bots on social media.\nThe discovery of 1,305 bot accounts on X (formerly Twitter) that spread political disinformation during a critical Republican debate and a Donald Trump interview have underscored the extent of the problem and its potential to disrupt the fabric of democratic discourse.\nIndiana University also conducted research that uncovered a bot network of 1,140 ChatGPT-powered X accounts that stole images to create fake profiles and engaged with each other through replies and tweets using advanced artificial intelligence (AI).\nThe battle against bots and fake accounts in social media\nFor traditional social networks, addressing this crisis of user authenticity is a daunting task. Over 47% of 2022’s web traffic was bot-generated, with 30% being harmful bots. Emerging as a potential solution with blockchain, Web3 offers mechanisms to ensure the authenticity of every participant on a specific platform.\nPhaver, a Web3 social app, introduces a gamified solution to fight against bot accounts and incentivize users to build a reputation on social media. By implementing a level system similar to loyalty tiers in airline programs, Phaver aims to discourage detrimental practices plaguing the current social media landscape, such as farming and multi-accounting.\nPhaver aims to build a more meritocratic and user-owned internet. Source: Phaver\nUsers accumulate a credibility score akin to status miles, which determines their level within the app. Phaver’s system penalizes harmful behaviors and rewards genuine engagement and credibility building with points — comparable to reward miles — instead of merely increasing follower numbers. Monthly redemption based on levels further disincentivizes abuse, promoting a healthier digital ecosystem. Users can increase their reputation, for example, by connecting various NFTs from a combination of wallets to their Phaver profile.\nFrom Web2 limitations to Web3 opportunities\nThe platform enhances the user experience with perks for different levels, including benefits within the app, such as increased Phaves (akin to super-likes) and the ability to post sponsored content, along with external rewards like access to partner whitelists. Designed to ensure a balanced supply-demand in the market, Phaver’s mechanism also offers benefits to early adopters, aiding the network’s growth.\nBy the end of 2023, Phaver’s innovative system had attracted over 100,000 wallets, connecting NFTs worth more than $100 million. With the uniqueness of profiles in higher levels reaching 99.9%, the platform showcases its effectiveness in fostering a genuine and engaged community.\nPhaver lets users opt in and out of the on-chain Lens posting depending on their needs. Source: Phaver\nPhaver has integration with the Lens Protocol, a Web3 social graph on the Polygon blockchain, and CyberConnect, a Web3 social network, to create a decentralized social platform where users can securely store their content on-chain.\nBy leveraging these technologies, Cointelegraph Accelerator participant Phaver safeguards user data against centralized control and ensures users can move seamlessly between apps without losing their content and followers.\nThe platform raised $7 million in funding and has shown robust traction, boasting over 250,000 unique app installs and more than 50,000 daily active users, with retention rates surpassing Web2 standards. According to Phaver, users in Korea average 6 hours weekly on the platform.\nToday, we are excited to announce that Phaver has raised $7M Seed financing round to accelerate further the adaptation of web3 social. 🦄 https://t.co/fVAIJ3LDmG pic.twitter.com/nNMJVcfQ2p\n— Phaver 🦄 (@phaverapp) October 5, 2023\nThe rise of bot networks and traditional platforms’ inability to discern between genuine and artificial accounts have highlighted the limitations of Web2 technologies. In response, the emergence of Web3 proposes a foundational shift for social media platforms, leveraging blockchain to authenticate user identities and interactions with the goal of restoring trust and authenticity in digital communities.\nLearn more about Phaver\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.",
      "article_summary": "Blockchain technology can address the pervasive issue of inauthentic users on social media.",
      "creation_date": "2024-03-07",
      "associated_tags": [
        "#Blockchain",
        "#Twitter",
        "#Decentralization",
        "#Social Media",
        "#Web3",
        "#Cointelegraph Accelerator"
      ],
      "category": "SPOTLIGHT",
      "article_link": "https://cointelegraph.com/news/web3-social-app-tackles-fake-accounts-with-an-innovative-engagement-system",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Showcase your talent: Web3 hackathon at BlockShow festival",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/elon-musk-open-source-grok-ai",
        "name": "Savannah Fortis"
      },
      "article_detailed_content": "The BlockShow x BlockDown Festival is set to host a hackathon, a 48-hour chain-agnostic event designed to showcase the talents of local Web3 developers and entrepreneurs in Hong Kong on May 8–9, 2024. The event is co-organized with Epic Web3, which has eight years of experience hosting conferences, communities and hackathons. In 2023, it organized and ran 10 events for Web3 developers.\nThe BlockShow x BlockDown Festival is a global Web3 community with a vibrant mix of builders, industry pioneers, thought leaders and entrepreneurs dedicated to making valuable industry events fun and engaging.\nAddy Crezee, founder of BlockShow by Cointelegraph, said:\n“The event we are bringing to Hong Kong on May 8–9 is bundled with a number of engaging and valuable activities, and a hackathon is definitely one of them. Developers are the fuel of Web3, and we are super excited to contribute with talents and new projects coming out after these 48 hours. Join us this May!”\nFor more information about the hackathon and how to enter, click here.\nBuild and pitch, win and celebrate\nThe hackathon offers two tracks for participants to compete in. The first is “startup,” where developers compete to launch innovative products contributing to mass adoption. The second is “tooling and infra,” which aims to build for the Web3 developer community.\nEpic ETH Infra Day in Istanbul, November 2023. Source:\nThe hackathon will begin on May 7, with the official kick-off and opening of the event before the technical workshops, mentoring sessions and project development begin the following day on May 8. The final day of the event, May 9, will include a pitching workshop and the submission of the projects. A pitching competition and awards ceremony for the best entries will close out the event.\nFor more information about the hackathon and how to enter, click here.\nParticipants will have the chance to win prizes for their successful submissions and funding for their projects of up to $50,000. As an added incentive, taking part in the hackathon will come with a dev pass, giving free access to the BlockShow X BlockDown event.\nGET YOUR TICKETS HERE TO ATTEND THE BLOCKSHOW X BLOCKDOWN FESTIVAL!\nAlex Pisarevski, the founder of EpicWeb3, said:\n“At Epic Web3, we have a lot of experience in organizing events for developers, and BlockShow and BlockDown do conferences at the highest level, bringing the best speakers from around the world. I’m sure this partnership will bring the best hackathon experience to Hong Kong.”\nThe submission requirements include an open-source code repository URL with publicly accessible code and an open-source license. A text description of the project’s features, functionality and chosen track is also required, along with a demonstration video of no more than three minutes.\nAll submissions must be in English, and at least one representative from each competing team must attend the hackathon in person.\nThose interested in participating can find more information and register for the event here and at DoraHacks.\nErhan Korhaliller, founder and CEO of EAK Digital and BlockDown Festival, said:\n“With the wild price movement in the markets, it’s important for the industry to remember that fostering education for developers and providing them with the latest Web3 tools and technology is pivotal to the sustainability of Web3 as an industry. We look forward to welcoming developer talent to take part in the hackathon at BlockShow x BlockDown.”\nCo-organized by Cointelegraph and EAK Digital, the BlockShow X BlockDown Asia 2024 event is expected to host 100 media outlets, industry speakers and more than 5,000 attendees. There will also be a gaming zone, gamification experiences, and Startup Connect, which will be an opportunity for investors and startups in the Web3 and cryptocurrency industry to find each other.\nGET YOUR TICKETS HERE TO ATTEND THE BLOCKSHOW X BLOCKDOWN FESTIVAL!",
      "article_summary": "Join the Hackathon co-organized with Epic Web3 in Hong Kong on May 8-9, 2024, as part of the BlockShow x BlockDown Festival, co-organized by Cointelegraph and EAK Digital.",
      "creation_date": "2024-03-07",
      "associated_tags": [
        "#Blockchain",
        "#Hong Kong",
        "#Asia",
        "#Event",
        "#Adoption",
        "#BlockShow"
      ],
      "category": "BLOCKSHOW",
      "article_link": "https://cointelegraph.com/news/hackathon-blockshow-blockdown-2024-hong-kong",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Singaporean fintech launches USDC-powered Visa card with Swiss bank Fiat24",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/israel-announces-plans-interest-bearing-shekel-cbdc",
        "name": "Zhiyuan Sun"
      },
      "article_detailed_content": "Singaporean fintech SafePal has made an investment into Swiss bank Fiat24 and jointly launched a crypto Visa card and in-app banking service with US Coin (USDC) as the default deposit currency. \nAccording to the March 7 announcement, the feature will be live on version 4.5.0 of the SafePal mobile wallet, subject to approval from Apple’s App Store and Google Play. \"Unlike typical Visa cards, the transactions on-chain on [USDC] Arbitrum provide a transparent, immutable ledger with faulty transfers reversible—but faulty transfers can still be reversed with our banking system,\" said Yang Lan, co-founder of Fiat24.\nMeanwhile, Veronica Wong, CEO and co-founder of SafePal, explained that after users create a USDC mobile wallet, the funds can then be sent to accounts at traditional financial institutions. In addition, users can swap crypto across more than 40 blockchains into their bank accounts and use fiat money, like the U.S. dollar, euro, or Swiss Franc, for transactions and expenses. Developers further stated:\n\"After creating the bank accounts in the SafePal mobile wallet, the credentials are minted as NFTs on Arbitrum (an Ethereum Layer 2 rollup), ensuring all related transactions are securely and transparently recorded on-chain. The crypto Visa cards are also linked to third-party payment platforms like Paypal, Google Pay, Apple Pay, and Samsung Pay, enhancing the convenience for users.\"\nSafePal currently operates as a self-custody wallet and claims it has approximately 10 million users worldwide. Shortly after the crypto winter of 2021-2022, the firm's CEO Veronica Wong told Cointelegraph that \"the malpractice of centralized platforms has indeed catalyzed the adoption of self-custody solutions. This should not just be a temporary surge of interest, but a key impetus to strengthen the adoption of self-management for assets.\"\nSince the collapse of centralized finance entities such as FTX and Celsius, self-custody wallets have been rising in popularity. On Dec. 7, 2023, Jack Dorsey’s Block launched a self-custody wallet solution with access in over 95 countries. On Aug. 10, 2023, cross-chain wallet BitKeep changed its name to Bitget Wallet after securing a $30 million investment from the exchange to grow its multichain swap platform. \nRelated: How to set up and create an Ethereum wallet",
      "article_summary": "After the creation of the bank account, credentials are minted as NFTs on Arbitrum network.",
      "creation_date": "2024-03-07",
      "associated_tags": [
        "#Blockchain",
        "#Cryptocurrencies",
        "#Singapore",
        "#Business",
        "#Mobile Wallet",
        "#Self Custody"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/singaporean-fintech-launches-usdc-powered-visa-card-swiss-bank-fiat24",
      "website_source": "Coin Telegraph"
    }
  ]
}