{
  "articles": [
    {
      "article_title": "Great Web3 games should be fully — not partially — on-chain",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/great-web3-games-should-be-fully-not-partially-on-chain",
        "name": "Felix Xu"
      },
      "article_detailed_content": "Gaming has been a catalyst in resurrecting Web3 from a year-long winter. It’s also a key force for mass adoption. Yet, the journey towards fully realizing the potential of Web3 gaming is fraught with challenges, notably the seamless integration of on-chain elements without sacrificing the core tenets of decentralization and player empowerment.\nNew users should only experience friction if necessary, and as late as possible. That’s not the case with most existing Web3 games. From connecting their wallets upfront to signing transactions for verification, users face multiple hurdles before actually trying the game. These frictions contrast starkly with the vision of a seamless and accessible gaming world that fully on-chain gaming aspires to achieve.\nTitles such as Axie Infinity and CryptoKitties, though groundbreaking, fall short of being fully on-chain. Fully on-chain games store all game assets, mechanics, and states on the blockchain. This radical approach ensures unparalleled transparency, security, and player control, allowing for a truly decentralized gaming experience where players own and shape their digital destinies.\nRelated: Axie Infinity is toxic for crypto gaming\nBuilding the best game demands a functional, efficient combination of on-chain elements and the rich user experience of legacy titles.\nHolding Web3 games to Web2 standards is comparing apples to oranges. Their requirements, value propositions, and scopes differ greatly despite serving similar audiences.\nWeb3 games are meant to solve age-old problems like top-down models, lack of user control, and strong-arming by gaming corporations. That’ll happen only by implementing alternative models, processes, and principles — not by emulating the outcomes achieved in Web2.\nWe can even argue that terms like “engaging,” “seamless,” and “hassle-free,” will take on new meanings in this context, enhanced by other aspects like community orientation, real in-game value, and user-generated logic.\nTherefore, when building Web3 games, the most crucial requirement is to address novel challenges, ideally involving embracing innovative technologies and models that align with the principles of autonomy and community governance. It’s about building “Autonomous Worlds” (AWs), a concept introduced in 2022 by Ludens — the founder of Lattice.xyz — to describe “a world with a blockchain substrate.”\nMoreover, new-age games must nurture and serve the expanding community of problem-aware gamers. Those who seek genuine solutions to the odds stacked against them in legacy gaming. Not mere bounty hunters and fleeting profit-mongers.\nBuilding fully on-chain games\nIronically, Axie Infinity and CryptoKitties served as pivotal catalysts in the evolution of blockchain gaming — but they weren't fully on-chain. They were experimental, niche, and heavily crypto-centric, characterized by their clunky user interfaces. Despite opening up new avenues, they weren’t entirely \"Autonomous Worlds\" either. Users had little or no control over the rules and direction of the game, and only parts of the game states were on-chain.\nneed help my ship is stuck in the ░F░O░G░ pic.twitter.com/Hn6jn3NTOK\n— The Citadel (@0xCitadel) March 6, 2024\nDark Forest was the first decentralized real-time strategy game, released in 2020. Using Zero-Knowledge Proofs (zkProofs), a cryptographic protocol, to create a “fog of war” in the gaming experience, this project set an example in building incomplete information games on-chain. For reference, think of games like poker, where players only see their hands and don’t know what cards others have.\nThe challenge Dark Forest tackled was maintaining a publicly accessible distributed ledger without compromising the confidentiality of players' strategies — a fundamental aspect in any strategic gameplay.\nUsing zkProofs, Dark Forest maintained gameplay integrity and player privacy on a blockchain. This approach solved the critical issue of revealing sensitive game states (e.g., planet locations or attack trajectories), which is easily manageable with centralized servers but very challenging in decentralized environments. Dark Forest's solution set a precedent for real-time strategy gaming on the blockchain, providing a blueprint for future on-chain game development.\nThey even sparked the proliferation of community-oriented, bottom-up AWs: Mithraeum, Citadel, ZkHunt, and so on. Loot Project was another interesting addition to this space, letting users permissionlessly expand the IP and spawning hundreds of games, lores, etc.\nMithraeum. Source: Screenshot\nBy putting everything on-chain — from game states (assets, actions, etc.) to logic (rules of introduction, mechanisms for in-game interactions, etc.), AWs unlock flexible and resilient digital realities where users come of their own.\nGoing beyond in-game asset ownership, they incentivize players to attach greater significance to their on-chain gaming activities. More importantly, on-chain logic provides gamers with a meaningful say in what’s legitimate and what’s not in the game-world.\nThis is a massive departure from the status quo, where end-users are mostly passive consumers, playing at the whims and mercy of corporate publishers. Rules and norms emerge via community consensus, not the arbitrary will of external entities. And they serve grassroots interests. Players can build, contribute, monetize, and participate in ways that are impossible in Web2 games.\nRelated: Why Solana will prevail despite Ethereum ETFs\nThe empowering, skin-in-the-game nature of AWs instills a stronger desire for mastery in gamers. They’re more driven to find creative solutions to solve problems and create mods and plugins to establish entirely separate economies within the game. This participatory fosters a deeper connection to the game, encouraging creativity, problem-solving, and collaboration within the community. For example, Dark Forest players have built a range of bots, plugins, and custom clients they can use to climb a leaderboard.\nAs we look to the future, the journey towards fully on-chain gaming is not without its challenges, yet the promise it holds is immense. By redefining engagement, ownership, and control within the digital realm, on-chain gaming is poised to offer experiences that more closely mirror real-world interactions and relationships. In doing so, it not only enhances the richness of virtual worlds but also establishes a new standard for what gaming can be—truly immersive, empowering, and reflective of the players' desires and aspirations.\nThe principles of decentralization, player sovereignty, and community collaboration will be the guiding lights, shaping the future of gaming into an inclusive, democratic, and exciting digital frontier.\nFelix Xu is a co-founder and CEO of ARPA. Felix graduated with Finance and Information Systems degrees from New York University. For the past six years, Felix has been working on venture capital investment in fintech, big data and AI startups. Most recently, Felix led blockchain sector research and early-stage investment at Fosun Group, one of the largest conglomerates in China.\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.",
      "article_summary": "Unlike games that rely partly on centralization (Axie Infinity), fully on-chain games give players more control — and get them more engaged.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Cryptocurrencies",
        "#Games",
        "#Blockchain Game",
        "#Web3",
        "#Gaming",
        "#Axie Infinity",
        "#GameFi"
      ],
      "category": "OPINION",
      "article_link": "https://cointelegraph.com/news/great-web3-games-should-be-fully-not-partially-on-chain",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "FDIC official urges better digital asset policy to maintain US influence",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/fdic-official-urges-better-digital-asset-policy-maintain-us-influence",
        "name": "Derek Andersen"
      },
      "article_detailed_content": "Bank customers and the United States economy could lose opportunities if a poor approach is taken to regulating blockchain technology, U.S. Federal Deposit Insurance Corporation (FDIC) vice chair Travis Hill told an audience at the Mercatus Center think tank on March 11. The United States is already at risk, Hill said, and the FDIC shares the blame for that.\nTokenization of bank deposits and other real-world assets (RWA) could make it possible to carry out financial transaction at any time with real-time settlement, Hill said. In addition, it would provide programmability of payments, making it possible to conduct intraday repurchase (repo) exchanges and improve settlement times for some bond issuances and numerous other transactions. Consumers could also benefit from using programmable payments in place of escrow.\nAmong the many open questions about tokenization, Hill mentioned the use, or not, of unified ledgers, blockchain interoperability and ownership rights as assets move along the blockchain. Furthermore:\n“Global standards are being established, directly or indirectly, and with many non-U.S. jurisdictions actively engaged in this area, the United States risks ceding influence at this critical stage.”\nProgrammability could reduce settlement risks and Know Your Customer processes, but it could also allow consumers to move their assets quickly, aggravating bank runs. An “off” switch is needed to prevent that, Hill said.\nSource: @FDICgov on X\nRegulatory agencies attempted in the past to set consistent policies with little luck, so “instead, the agencies established processes under which institutions must engage with their regulator on an individual basis,” Hill said.\nRelated: Inspector General wants FDIC to refine crypto risk assessment process, guidance\nLooking at FDIC regulations, which treat all transactions on a blockchain — whether they involve RWA or crypto — the same, Hill found them to be cumbersome and unequally applied:\n“Institutions have spent months responding to a long stream of information requests, diverting attention away from developing new technologies and systems. […] The message being heard by the vast majority of the industry could be interpreted as don't bother trying.”\nGuidance is needed from regulators, as is consistency so that deposits in any form are treated the same, Hill said. He criticized the Securities and Exchange Commission’s (SEC’s) controversial Staff Accounting Bulletin 121 (SAB 121), which requires financial institutions to treat crypto assets differently from any other kind of asset. The definition of crypto asset used in the bulletin is broad enough to include tokenized RWA, he said.\nMagazine: Block by block: Blockchain technology is transforming the real estate market\nExplore more articles like this\nSubscribe to the Law Decoded newsletter\nA weekly summary of the latest news in crypto legislation and regulations. Delivered every Monday\nSubscribe\nBy subscribing, you agree to our Terms of Services and Privacy Policy",
      "article_summary": "FDIC vice chair Travis Hill did not spare his own agency in his assessment of current digital asset regulation.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#United States",
        "#Tokens",
        "#Regulation",
        "#Blockchain",
        "#Israel",
        "#Business",
        "#Adoption",
        "#CBDC"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/fdic-official-urges-better-digital-asset-policy-maintain-us-influence",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Israel announces plans for interest-bearing shekel CBDC",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/israel-announces-plans-interest-bearing-shekel-cbdc",
        "name": "Zhiyuan Sun"
      },
      "article_detailed_content": "Israel’s central bank will support a new Israeli shekel central bank digital currency (CBDC) that has the option of bearing interest.\nIn the March 11 announcement, the Bank of Israel outlined that its shekel CBDC will be implemented in a two-tier model, with instant, 24/7 payments, multipayment support, offline use, limitations on balances and an option for the CBDC to become interest-bearing. The central bank wrote: \n“In the area of privacy, the architecture will allow the central bank, as the system administrator, to define the types of information required for the operation, control, and monitoring of the system. However, the central bank will not have access to personally identifiable information about end users’ balances and transactions.”\nCurrently, commercial banks in Israel pay 4.86% interest on customers’ fiat shekel deposits and savings. Under the central bank’s plans, banks would be able to hold the shekel CBDC as part of their short-term liquidity buffer, which would be non-interest bearing. \n“The data structure must enable the system to comply with all of the assumptions defined in Section 2.1, including the ability to enforce holding restrictions and to apply interest,” researchers wrote, adding: “In particular, in a case where the interest is dependent on the type of user and the size of the balance, there is an advantage to having a centralized database.”\nIsrael has been contemplating the issuance of a digital shekel since 2021, but no concrete pilot tests have been actioned as of the time of publication. “Given the interdependence between the various components of the digital shekel system, the decisions are not final,” said the Bank of Israel. \nIn April 2023, Cointelegraph reported that the country’s central bank could issue a shekel CBDC if stablecoin use increases. “At this point, there are no signs of substantial adoption of stablecoins as means of payment in Israel,” the central bank said at the time.\nRelated: Local Web3 community launches ‘Crypto Aid Israel’ to help displaced citizens\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nA weekly pulse of the business behind blockchain and crypto. Delivered every Thursday\nSubscribe",
      "article_summary": "Although plans for a shekel CBDC have been in place since 2021, no pilot tests have since carried forward.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Israel",
        "#Business",
        "#Adoption",
        "#CBDC"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/israel-announces-plans-interest-bearing-shekel-cbdc",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Music NFTs can reshape the indie music industry — Here’s how",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/music-nfts-can-reshape-the-indie-music-industry-heres-how",
        "name": "Janina Winter"
      },
      "article_detailed_content": "Independent (indie) musicians face many challenges on their way to recognition and financial stability, often stemming from the centralized nature of Web2 platforms such as Spotify, Apple Music and SoundCloud. While these platforms initially offered promising paths to exposure, the reality has fallen short, leaving artists struggling to secure fair compensation in terms of royalties and control over their work.\nThe issue lies in the way streaming services distribute revenue: a meager portion reaches the artists themselves, with record labels often negotiating significantly higher payouts than indie musicians for their work. Spotify’s reported payout per stream further exemplifies this disparity, falling within a paltry range of $0.003 to $0.005 in 2024.\nAdding insult to injury, Spotify’s recent policy change throws another obstacle in the path of indie artists. In 2024, the platform will cease royalties for tracks receiving fewer than 1,000 streams within a year. While technicalities suggest these tracks will still accrue royalties, the funds will be funneled upward, often benefiting bigger artists. This 1,000-stream cliff creates a significant barrier for indie musicians attempting to break through and build a fanbase.\nOne stat you won’t find in your Spotify Wrapped is how much artists are paid for all that listening on the platform.\n\nThe max possible in 2023 is $0.003 per stream. And in 2024, Spotify will stop paying anything AT ALL for 2/3 of the tracks on the platform. pic.twitter.com/OCMHsHNce5\n— United Musicians and Allied Workers (@UMAW_) November 29, 2023\nAnother major challenge for indie artists is building a loyal fanbase. The current market is saturated with countless independent artists vying for attention. Building a personal brand and effectively utilizing social media platforms can help indie musicians connect with their audience and cultivate a fanbase, but it takes time, money and effort to make it big.\nHow NFTs can help musicians\nThis is where Web3, particularly nonfungible tokens (NFTs), emerges as a solution with the potential to transform the indie music industry. Music NFTs allow artists to sell songs, albums or exclusive digital content directly to their fans. The NFT approach bypasses intermediaries like record labels and streaming platforms, allowing artists to capture a larger share of the revenue generated by their work. Unlike streaming, where earnings are based on unpredictable play counts, NFTs offer the potential for more transparent and direct income streams.\nMusic NFTs also act as a bridge between artists and their fans, fostering a sense of community and ownership. By owning an NFT, fans actively support the artist and gain access to various benefits like early access to new songs or exclusive behind-the-scenes content.\nThe limitations of current music NFTs\nWhile music NFTs already exist on several blockchains, they can only represent one digital asset, such as a single song. This restriction is highly inflexible, as musicians typically work with multiple songs packaged as an album or playlist.\nThe current music NFTs are permanently static, lacking the capacity for updates or changes. Musicians desire the ability to evolve and modify their music and copyright terms over time, enhancing fan engagement by offering a continuous stream of fresh content.\nAlthough music NFTs hold great promise for fostering deeper connections with fan bases, this potential hinges on one critical factor — the ability to update the information embedded in the NFT itself.\nIntroducing dynamic Data NFTs\nItheum Protocol, an omni-chain data ownership infrastructure layer , aims to overcome these limitations by allowing musicians to develop and update their content through its Music Data NFT technology.\nAt the heart of the Itheum Protocol lies Data NFT technology, which allows musicians to transform static or dynamic data assets into NFTs. These NFTs function as transferable licenses, granting ownership and control over sharing or trading access rights to the data. Data NFTs empower creators to tokenize their data, similar to other NFT assets, but with the added flexibility of managing access rights.\nUnlike traditional NFTs that represent static assets, Music Data NFTs can be updated by artists, allowing for evolving content. This dynamic capability has the potential to enhance fan engagement, offering features like unlocking additional content upon interaction. Moreover, Music Data NFTs give artists greater control over distribution and royalty structures.\nVerified fans who own Data NFTs can also establish direct communication with artists, creating access opportunities for exclusive content such as unreleased music or merchandise. This connection could strengthen the bond between musicians and their fanbase.\nCointelegraph Accelerator participant Itheum envisions Music Data NFTs operating seamlessly across various blockchains. The envisioned interoperability enables artists to access diverse NFT ecosystems, potentially building fanbases and extending their exposure to a broader audience across various blockchain communities.\nKey features of Data NFTs. Source: Itheum Protocol\nGiving the power to musicians and fans\nMusicians can showcase their Music Data NFTs on NF.Tunes, a Web3 music portal built on Itheum Protocol’s technology. The platform serves as a space for artists to exhibit their music Data NFTs, allowing fans to explore and listen to new music while engaging with artist communities.\nWith its Music Data NFTs, Itheum paves the way for a more artist-centric future in the music industry. By addressing the limitations of the current NFT models, Itheum offers a glimpse into a future where indie musicians not only navigate the labyrinthine world of music but thrive in it.\nAre you an indie musician who wants to use Music Data NFTs? Get onboarded here.\nLearn more about Itheum Protocol\n#Blockchain\n#Music\n#Data\n#Web3\n#NFT\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.",
      "article_summary": "Existing music NFTs can only represent one song and can’t be updated, limiting artists who want to offer evolving content.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Music",
        "#Data",
        "#Web3",
        "#NFT"
      ],
      "category": "USE CASE",
      "article_link": "https://cointelegraph.com/news/music-nfts-can-reshape-the-indie-music-industry-heres-how",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Inside Altcoin Daily’s crypto bull market strategy",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/inside-altcoin-daily-crypto-bull-market-strategy",
        "name": "Marco Castrovilli"
      },
      "article_detailed_content": "Bitcoin price is likely to experience a major correction around the Bitcoin halving anticipated for April, according to Aaron and Austin Arnold, the founders of the Altcoin Daily YouTube channel.  \nStill, they said the price dip will be quickly bought by institutional players such as BlackRock, which have been deeply involved in the market since the approval of Bitcoin (BTC) spot exchange-traded funds (ETFs) in January.\nBitcoin recently broke through its previous all-time high, reaching north of $72,000. \nThe current rally appears to be driven by BlackRock, Fidelity and other institutional investors buying Bitcoin for their new ETFs.\nAccording to Austin, the latest rally caught many retail investors off guard, as they were not expecting Bitcoin to rise so rapidly toward its all-time highs.\n“A lot of people would welcome a crash. I think the institutions are trying as hard as they can not to let that happen,” he said.\nAccording to his brother, Aaron, the big differentiator between this and previous bull runs is that spot ETFs have allowed Bitcoin to cross the chasm between early adopters and the early majority, referencing the lifecycle of technology adoption. \n“Wall Street is in for real this time,” he said. “That is a big differentiator.” \nAt the same time, they said the bulk of retail investors have not entered the market yet, which seems to suggest that we are still in a relatively early stage of the bull market.\n“Retail largely isn’t here yet based on the social engagement, on Google Trends,” Austin said. \nTo find out more about Altcoin Daily’s outlook on the current bull market, check out the full interview on Cointelegraph’s YouTube channel — and don’t forget to subscribe!",
      "article_summary": "Popular crypto YouTubers Austin and Aaron Aarnold share their tips to take the most out of the current bull market in an exclusive interview with Cointelegraph.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Bitcoin",
        "#Blockchain",
        "#Cryptocurrencies",
        "#Altcoin",
        "#Ethereum",
        "#Bitcoin Price",
        "#Technology",
        "#Bitcoin Analysis",
        "#Investments",
        "#SEC",
        "#Adoption",
        "#Markets",
        "#Predictions",
        "#Tokens",
        "#Market Update",
        "#Market Analysis",
        "#Trading",
        "#Ether Price",
        "#Bitcoin",
        "#Cryptocurrencies",
        "#Elections",
        "#Donald Trump",
        "#CBDC",
        "#Regulation"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/inside-altcoin-daily-crypto-bull-market-strategy",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Ubisoft is now a validator on the XPLA blockchain",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/futureverse-studios-debuts-trailer-web3-readyverse-battle-royale-game",
        "name": "Tristan Greene"
      },
      "article_detailed_content": "Ubisoft, the maker of several hit gaming franchises — including Assassin’s Creed and Far Cry — has joined the XPLA blockchain as a node validator. \nThe French gaming giant has long dabbled in Web3, blockchain and cryptocurrency services alongside its gaming verticals. This latest move, made through its Strategic Innovation Lab, sets the stage for Ubisoft to contribute to the XPLA network beyond principal validation duties.\nAccording to a press release from XPLA, Ubisoft will “actively participate in governance proposal decisions” as part of the partnership. \nBlockchain\nXPLA is a Tendermint-based, layer-1, open-source blockchain developed to foster the transition from Web2 to Web3 gaming. Its mainnet was launched in August 2022 with the stated core goal of empowering players in a “play to own” gaming paradigm.\nSome of the most popular intellectual properties with games on the XPLA blockchain include The Walking Dead: All-Stars and Summoners War: Chronicles.\nPer a blog post from XPLA, its latest partnership is a growth marker for the network:\n“The addition of Ubisoft, a global gaming company, to the XPLA family is just the beginning! We eagerly anticipate more validators joining our ecosystem, enhancing the security and stability of our network.”\nGaming\nUbisoft, based in Rennes, France, is among the world’s largest gaming companies. Its games have won myriad awards and sold a combined total of somewhere around 800 million titles. With a market capitalization of $2.75 billion as of the time of publication, it’s the second largest in Europe, behind only Poland’s CD Projekt Red ($2.99 billion).\nThe company was among the earliest gaming firms to invest in Web3 and blockchain technology. Back in 2021, it published a manifesto laying out its plans in the blockchain and Web3 spaces with heavy emphasis on player agency and ownership.\nAs Cointelegraph reported in October 2021, Ubisoft is also a major investor in Animoca Brands, a Hong Kong-based blockchain games developer. \nBlockchain gaming continues to rise in popularity as the Web3 space begins to fill out. While it still hasn’t reached its early promises of decentralizing gaming assets at scale and revolutionizing the role of nonfungible tokens (NFTs) in the public perception, the steady entrance of major gaming outfits such as Ubisoft and Square-Enix bodes well for the sector.\nRelated: Square Enix will modify organizational structure to support blockchain, Web3, AI in 2024\nExplore more articles like this\nSubscribe to the Nifty Newsletter\nA weekly summary of the latest NFT headlines. Delivered every Wednesday\nSubscribe",
      "article_summary": "The blockchain gaming sector is starting to pick up steam.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Business",
        "#Games",
        "#Blockchain Game",
        "#NFT",
        "#Gaming"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/ubisoft-validator-web3-nft-xpla-blockchain-gaming",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Bitcoin miner Bitfarms purchases additional 51,908 ASICs amid bull market",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/israel-announces-plans-interest-bearing-shekel-cbdc",
        "name": "Zhiyuan Sun"
      },
      "article_detailed_content": "Canadian Bitcoin (BTC) miner Bitfarms exercised an option on March 11 to purchase 28,000 Bitmain T21 ASIC miners and 19,280 Bitmain T21 miners, for $14 per terrahash (TH) as well as 3,888 Bitmain S21 miners and 740 Bitmain S21 hydro miners for $17.50/TH, for a total of 51,908 ASICs. \nAt the time of publication, each Bitmain T21 ASIC miner costs around $3,000 retail and possesses a hash rate of 190 TH/s. \nGeoff Morphy, president and CEO of Bitfarms, said the company secured additional miners \"before anticipated hardware price increases.\" He also noted that the ASICs are scheduled for delivery this year and are expected to bring the firm's total hash rate to 21 exahashes per second (EH/s), or around 3% of the processing capacity of the Bitcoin network. \nOn March 8, Bitfarms announced a $375 at-the-market (ATM) million equity offering program. “The Company intends to use the net proceeds of the ATM Program, if any, primarily on capital expenditures to support the growth and development of the Company’s existing mining operations as well as for working capital and general corporate purposes,” Bitfarms wrote.\nThe company currently has 11 operating Bitcoin mining facilities, with additional developments in Canada, the United States, Paraguay and Argentina.\nDespite an ongoing crypto bull market, Bitfarms’ stock has fallen over 38% this year, as with its peers, even as Bitcoin reached new all-time highs. The reason can be partially attributed to the upcoming Bitcoin halving in April, where block rewards are scheduled to be slashed in half, thereby reducing miners’ bottom line. The firm has been actively scaling its operations in the past year in anticipation of the halving event. \nRelated: Bitcoin breaches $71K for the first time\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd",
      "article_summary": "The price of Bitcoin has reached an all-time high above $72,000.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Bitcoin",
        "#Blockchain",
        "#Cryptocurrencies",
        "#Adoption"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/bitcoin-miner-bitfarms-purchases-additional-51908-asics-amid-bull-market",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Korean MMORPG MapleStory opens gaming experience on Avalanche",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/israel-announces-plans-interest-bearing-shekel-cbdc",
        "name": "Zhiyuan Sun"
      },
      "article_detailed_content": "MapleStory, a massively multiplayer online role-playing game (MMORPG) developed by South Korean video game publisher Nexon with over 400,000 daily active users, will expand its gaming experience to the Avalanche blockchain.\nAccording to a March 11 announcement dubbed “MapleStory N,” the game will be powered by an Avalanche subnet on the namesake blockchain’s cloud network “to proceed without a separate implementation partner, providing greater convenience, more support options, and quick time to market” and offer users new content-generating opportunities. “Users can build out enticing new worlds, extending gameplay, and adding their footprint to the MapleStory Universe,” a spokesperson for Avalanche wrote.\nThe game is scheduled to launch later in 2024. “Our partnership with Ava Labs will allow us to build a stable and complete blockchain ecosystem, enabling us to securely service various dApps along with MapleStory N to amplify our competitiveness,” commented Angela Son, MapleStory Universe’s partnership lead.\nCreated in 2003, MapleStory has immense popularity in the Asia-Pacific region and has surpassed 180 million registered players. Its Web3 venture, MapleStory Universe, uses various nonfungible tokens (NFTs) to enhance the in-game experiences.\nSimilarly, on March 22, 2023, its parent Nexon selected the Ethereum layer-2 scaling solution Polygon to power its blockchain ecosystem. According to Nexon, a Polygon supernet created by Polygon Labs will be deployed within Maplestory to allow players to earn and collect in-game items as NFTs. \nYes yes, I know it's been a while, took my vacation anyway. Crucify me.\n\nSoooo...marketplace (special thanks to all the fans out there, your likes have brought us here ). What's new? pic.twitter.com/gVY8lRaYrM\n— MapleStory Universe (@MaplestoryU) March 5, 2024\nThe Avalanche network has been gaining traction in 2024, partly due to traditional financial heavyweights, such as JPMorgan and Citi, partnering with the Avalanche Foundation for their real-world asset tokenization initiatives and new technological deployments on its blockchain.\nOn Jan. 15, Cointelegraph reported that Avalanche inscriptions drew record user interest amid a hype of Bitcoin BRC-20 inscription tokens. Over 100 million Avalanche inscriptions have been minted since their creation in 2023.\nRelated: Justin Sun vs. SEC, Do Kwon arrested, 180M player game taps Polygon\nExchange or buy AVAX\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd",
      "article_summary": "The game was created in 2003 and has had over 180 million user signups since its inception.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Adoption",
        "#Avalanche",
        "#Gaming"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/korean-mmorpg-maplestory-opens-gaming-experience-avalanche",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Tether stablecoin USDT is coming to Celo blockchain",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/tether-stablecoin-usdt-celo-blockchain",
        "name": "Helen Partz"
      },
      "article_detailed_content": "Major stablecoin operator Tether continues to expand its USDT stablecoin across various blockchain networks, entering a strategic collaboration with the Celo network.\nTether (USDT) on Celo, an Ethereum Virtual Machine (EVM)-compatible layer-1 network designed for fast and low-cost payments.\nAnnouncing the news to Cointelegraph on March 11, Tether noted that the new integration brings a range of benefits to USDT, including “notably low, sub-cent transaction fees” hovering around $0.001, enabling feasible microtransactions.\n“One of Celo’s core features since launching in April 2020 was its design for fast, low-cost payments worldwide,” a source close to Celo told Cointelegraph. “Indirectly, as an L2, there is a value sharing happening with Ethereum that’s not happening today as an L1,” a spokesperson said, adding:\n“In transitioning to an Ethereum L2, gas fees would stay low, critical to achieving global prosperity and core to the Celo community mission.”\nUSDT will join an array of stable assets available on the Celo platform, including Mento’s eXOF, which tracks the CFA franc, and the cREAL, which tracks the Brazilian real. The use cases for stable assets on Celo include remittances, savings, lending and cross-border payments.\n“We are thrilled to welcome Tether USDT to the Celo ecosystem, which is fast becoming a leader in stablecoins and real-world assets,” Celo co-founder and foundation president Rene Reinsberg said.\n“With Tether USDT soon available on Celo, users have even more options for fast, low-cost payments and access to robust stablecoin use cases that benefit everyday users around the world,” Reinsberg noted.\nA Tether representative declined to say when the first batch of USDT will be issued and go live on the Celo blockchain.\nRelated: Tether launches recovery tool to migrate USDT between blockchains\nUSDT’s major rival, the Circle-issued USD Coin (USDC), announced a native launch on the Celo blockchain in January 2024 as well. Circle said the first USDC became available on Celo on Feb. 22.\nCelo-based USDT will join 14 blockchains currently supported by Tether, including Tron, Ethereum, Solana, Avalanche and Omni. Tron and Ethereum are the two largest blockchains for USDT at the time of writing, accounting for 50% and 45% of all issued USDT, respectively, according to Tether Transparency.\nThe news comes amid the crypto community increasingly complaining about high fees on the Ethereum network as Ether (ETH) prices pass $4,000. Skyrocketing ETH fees have also impacted Ethereum-based USDT, as ERC-20 Tether USDT requires ETH gas fees to complete transactions.\nDespite Celo being an EVM-compatible network, there is no dependency on Ethereum in terms of network fees, according to a source close to Celo. “For example, if Ethereum fees go up, it doesn’t mean L2 fees, given certain architectural choices, go up in the same way or at all even,” the person noted.\nMagazine: The DeFi bots pumping Solana’s stablecoin volume\nExchange or buy USDT\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd",
      "article_summary": "Tether has entered a collaboration with Celo to enable “sub-cent transaction fees” for USDT and facilitate feasible microtransactions.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Cryptocurrencies",
        "#Altcoin",
        "#Tether",
        "#Stablecoin",
        "#Celo"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/tether-stablecoin-usdt-celo-blockchain",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Whales, Sybil attacks and low trust: Can DAOs avoid centralization pitfalls?",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/music-nfts-can-reshape-the-indie-music-industry-heres-how",
        "name": "Janina Winter"
      },
      "article_detailed_content": "Imagine a future where organizations operate not under individuals’ control but by a community’s collective will. Decisions are made collaboratively in an environment where the power is distributed among members, not concentrated in a central authority. This concept, once confined to the realm of science fiction, is now taking shape in the form of decentralized autonomous organizations (DAOs).\nDAOs are internet-based organizations fueled by blockchain technology. They function through smart contracts, self-executing code that automates decision-making based on established rules. Ownership and voting rights are often linked to crypto tokens, empowering members to actively shape the DAO’s trajectory. This structure upholds transparency as all transactions and decisions are permanently recorded on the blockchain, accessible for public scrutiny.\nThe challenges around DAOs\nBut as with any disruptive innovation, DAOs come with their own set of challenges, raising a critical question: can they truly revolutionize governance, or are they destined to remain a captivating experiment?\nOne of the most significant challenges facing DAOs is the potential for large tokenholders, known as whales, to influence voting outcomes in their favor. Due to their extensive holdings, whales can manipulate governance outcomes, undermining the collective decision-making process and jeopardizing the fairness and legitimacy of the DAO. According to a research paper, voting power in DAO governance systems is unfair and highly centralized, with fewer than 10 addresses having full control over most DAOs. The study shows that for crypto platforms Compound, Fei and Uniswap, the community delegate vote share is low at about 10% or less.\nThe centralization issue in the voting process is further exacerbated by Sybil attacks, where individuals impersonate multiple voters to skew outcomes using the ease of creating multiple accounts. These attacks can erode trust and hinder the legitimacy of a DAO’s governance.\nWhile some participants in DAOs may be aligned with collective interests and long-term goals, investors will inevitably be driven solely by quick profits, disregarding a project’s sustainability and future. The intrinsic importance of tradeable governance tokens in DAO operations makes aligning financial incentives and community interests challenging, particularly in optimizing a project’s growth potential over time.\nRecognition of diverse contributions\nSecure identity verification measures and a transparent governance system can solve the problems within DAOs. AirDAO, a community-governed layer-1 blockchain, recognizes the solution and aims to make decentralized finance (DeFi) more accessible, fair and user-friendly for everyone.\nBuilt on its own blockchain network -AMB-NET- AirDAO offers a product suite to simplify complex financial operations. The suite includes cross-chain bridging to Ethereum and BNB Smart Chain along with a staking platform, a multichain network explorer and FirepotSwap — a native decentralized exchange (DEX) developed in partnership with Firepot Finance.\nUnderstanding the challenges of governance manipulation and multiple account creation, AirDAO implemented solutions to foster a fairer and more inclusive decision-making process:\nFacial verification: Through a partnership with Fractal ID, a provider of Web3 identity solutions, AirDAO links wallets to users using facial verification technology. The integration enables the creation of decentralized identifiers (DIDs) that verify identities without requiring the disclosure of personal information or compromising user anonymity. Facial verification reduces the ability to create multiple accounts, ensures each vote is from a unique participant and promotes transparency and accountability.\nThe issuance of the AirDAO’s governance soulbound token (SBT), AMB, is also based on the user’s facial recognition biometric data verified by Fractal ID.\nImpact-based governance: AirDAO’s system rewards users with soulbound tokens (SBTs) based on their contributions to the platform, such as providing liquidity or participating in governance discussions. SBTs determine an individual’s voting power, giving a stronger voice to those who actively contribute to the project’s success.\nAirDAO rewards the community for contributing to its ecosystem with impact-based SBTs. Source: AirDAO\nAirDAO recognizes that its success relies on the contributions of a diverse community. Whether users validate transactions, contribute their skills or champion AirDAO as a Governor or Ambassador, their efforts will be crowned with governance SBTs that reflect users’ benefits to the ecosystem.\nA vision for decentralization\nAirDAO’s Governance Working Group (GWG), comprised of around 30 community members with expertise in various fields, underlines the platform’s commitment to community governance.\nAirDAO’s vision is to complete decentralization and become a fully community-governed project that fosters collective decision-making within the DeFi space. If successful, AirDAO’s potential to address key challenges in DAO governance could pave the way for a more equitable and trustworthy future for DAOs and the wider DeFi ecosystem.\nLearn more about AirDAO Governance Platform\nJoin support Telegram group for AirDAO governors\n#Blockchain\n#Security\n#Decentralization\n#Identity\n#DAO\n#DeFi\nDisclaimer. Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.",
      "article_summary": "DAOs promise collective and transparent decision-making. However, whales and fake accounts threaten fair voting.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Security",
        "#Decentralization",
        "#Identity",
        "#DAO",
        "#DeFi"
      ],
      "category": "USE CASE",
      "article_link": "https://cointelegraph.com/news/whales-sybil-attacks-and-low-trust-can-daos-avoid-centralization-pitfalls",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "DeFi protocol Unizen to provide ‘immediate reimbursement’ after $2.1M hack",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/arbitrum-2-billion-vested-token-unlock",
        "name": "Ezra Reguerra"
      },
      "article_detailed_content": "Decentralized finance (DeFi) protocol Unizen announced that it would reimburse its users who lost 750,000 or less “as soon as humanly possible” after the platform got compromised, losing about $2.1 million in user funds.\nOn March 9, blockchain analytics firm PeckShield flagged an “approve issue” with the DeFi platform, reporting that over $2 million had already been drained. The security firm urged users to revoke the approvals from the trade aggregator to avoid further loss. Security company SlowMist estimated the exploit losses to be around $2.1 million and noted that the attacker swapped the Tether (USDT) for the stablecoin Dai (DAI).\nA day later, the DeFi protocol sent an on-chain message to the hacker, offering a 20% bounty in exchange for returning the remaining stolen funds. The protocol also said they are already working with law enforcement and forensic experts to determine the hacker’s identity.\nOn-chain message sent by Unizen to the hacker. Source: Etherscan\nWhile the bounty negotiations are still ongoing, the DeFi protocol was quick to refund victims of the hack. On March 11, the company announced it would make 99% of the affected users whole as soon as possible.\n“Reimbursement for the rest of those will be given to the same wallets affected starting immediately. While we intend to start distributions today, we are going through each distribution individually in a slow, careful and methodical manner,” they wrote.\nRelated: Crypto phishers stole $47M last month, impersonators on X to blame\nAccording to the announcement, Unizen founder and CEO Sean Noga loaned funds to the company to refund the hack victims. Users who lost below $750,000 will get their funds back, with refunds starting on March 11.\nThe company will return funds in USDT or USD Coin (USDC). However, for those who lost more than $750,000, the DeFi protocol said they would handle the issue on a case-to-case basis. Along with the announcement, the company also shared a video guide teaching users how to review and revoke approvals within the platform to avoid further losses. \nUnizen chief technology officer Martin Granström also said on X they have already collected enough evidence for a post-mortem report and are working with third-party firms on the matter. The executive announced that they would share an incident report soon and promised to invest more in security in the future.\nMagazine: DeFi’s billion-dollar secret: The insiders responsible for hacks\nExplore more articles like this\nSubscribe to the Finance Redefined newsletter\nA weekly summary of the most impactful DeFi stories, insights and education developments. Delivered every Friday\nSubscribe",
      "article_summary": "DeFi protocol Unizen announced that it will issue an immediate refund to users who lost their funds to an exploit this weekend.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Security",
        "#Hackers",
        "#Cybersecurity",
        "#Hacks",
        "#DeFi"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/unizen-hack-immediate-refund",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Bitcoin halving: What’s different this time around?",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/bitcoin-halving-different-this-time",
        "name": "Brayden Lindrea"
      },
      "article_detailed_content": "Bitcoin’s supply and demand dynamic will be even more favorable than after previous halvings in 2012, 2016 and 2020, thanks to the recent launch of spot Bitcoin exchange-traded funds (ETFs) in the United States.\nBitcoin (BTC) halvings cut miner rewards in half every 210,000 blocks, which is approximately every 48 months.\nThe next halving event will occur at block 840,000 — expected to take place on April 20 — and will see mining rewards reduced from 6.25 BTC ($418,800) to 3.125 BTC ($209,400).\nHistory shows Bitcoin’s price starts ticking upward to break previous all-time highs about four or five months after the halving.\nOn May 11, 2020, during the previous halving, Bitcoin was priced at $8,750. It surged 430% five months later, from $11,500 to $61,300 by mid-March 2021.\nIn doing so, it smashed the previous all-time high of $19,665 on Dec. 16, 2017.\nBitcoin’s change in price between May 11, 2020 and March 15, 2021. Source: CoinGecko\nAnalysts have primarily attributed this to spot Bitcoin ETFs, which have caused a radical change in Bitcoin’s supply and demand dynamic, according to Jaran Mellerud, a founder and chief strategist at Hashlab Mining, who recently spoke with Cointelegraph.\nSpot Bitcoin ETF issuers are scooping up 2,450 BTC each day while only 900 BTC are mined, Mellerud noted.\n“This number will fall to 450 BTC post-halving in late April [where the ETFs will be] sweeping up BTC at a rate five times higher than BTC’s post-halving supply growth. This huge imbalance between supply and demand will lead to a continuous but volatile upward grind of the BTC price.”\nMellerud comments on Bitcoin’s supply and demand imbalance. Source: Jaran Mellerud on X\nThis will multiply Bitcoin’s demand at a time when the halving will reduce its supply, said Mellerud, who expects Bitcoin’s price to rise substantially higher as a result.\nSouce: Matt Hougan on X\nBitcoin is now more decentralized and secure\nThe health of the Bitcoin network has also strengthened, according to Mellerud, who noted that Bitcoin’s hash rate is five times higher than it was at the last halving.\n“It now requires five times more computing power and associated electricity supply, electrical infrastructure, and mining hardware to attack the network.”\nThe network was already tremendously secure at the time of the 2020 halving, but now it is basically impenetrable, Mellerud added.\nRelated: Bitcoin mining battles 2023 — Surging hash rates test industry limits\nMellerud noted that Bitcoin’s hash rate is now more widely distributed than at the time of the last halving, where Chinese miners controlled a large share of the network.\n“This geographic decentralization is continuing as miners migrate to Africa and Latin America to take advantage of cheaper electricity prices,” he said.\nSouce: Alex Gladstein on X\nExchange or buy BTC\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd",
      "article_summary": "Fewer Bitcoin entering circulation after the halving will be met with increased demand from spot Bitcoin ETF issuers, leading to a “continuous, but volatile upward grind” in price, a mining analyst says.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Bitcoin",
        "#Blockchain",
        "#Mining",
        "#Bitcoin Mining",
        "#Halving",
        "#Bitcoin Halving"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/bitcoin-halving-different-this-time",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "A ‘simple’ hard fork could subvert a quantum attack on Ethereum: Vitalik Buterin",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/large-corporations-wirehouses-prepare-bitcoin-etf-bitwise",
        "name": "Tom Mitchelhill"
      },
      "article_detailed_content": "Ethereum is already “well-positioned” to mitigate the impact of a massive quantum computing attack on the network, according to Ethereum co-founder Vitalik Buterin.\nIn a March 9 post to Ethereum Research, Buterin discussed what would happen if a “quantum emergency” happened as early as tomorrow.\n“Suppose that it is announced tomorrow that quantum computers are available, and bad actors already have access to them and are able to use them to steal users’ funds,” Buterin postulated.\n“I argue that actually, we are already well-positioned to make a pretty simple recovery fork to deal with such a situation.”\n“The blockchain would have to hard fork and users would have to download new wallet software, but few users would lose their funds,” he added.\nButerin explained that the process of such a hard fork would involve rolling back the Ethereum network to the point where it is clear that “large-scale theft” was occurring and disabling all traditional transactions from that point.\nEthereum developers would then add a new transaction type — which forms part of the Ethereum Improvement Proposal (EIP) 7560 — to allow transactions from smart contract wallets.\nButerin’s breakdown of the EIP required to prevent a quantum-related exploit on Ethereum. Source: Ethereum Research\nWhen a user makes a transaction from their Ethereum wallet, the signature of that transaction reveals the public key, and in a “post-quantum world,” this would see the user’s private key revealed as well.\nThe new transaction type that forms the core part of the quantum-resist EIP would leverage Winternitz signatures and zero-knowledge proof technologies known as “STARKs” to ensure that existing wallets are switched to new validation code, he added.\nAn anonymous user shared an illustrated diagram of Buterin’s theoretical EIP. Source: Ethereum Research\nThis validation code leverages ERC-4337 account abstraction — the underlying technology of smart contract wallets — to prevent private keys from being displayed while signing transactions in the future, rendering these accounts immune from a quantum attack.\nRelated: Ethereum leans into rollup-centric future as Dencun hard fork looms\nAccording to Buterin, users who have never approved a transaction from an Ethereum wallet are “already safe” from any potential quantum-related exploit, as only the wallet address has ever been made publicly available.\nHe also added that the infrastructure needed to implement such as hard fork “could in principle start to be built tomorrow.”\nThe advent of quantum computing has been a long-feared inflection point for the crypto industry, as a computer capable of breaking blockchain encryption could see once-untouchable user funds stolen in large volumes and at rapid rates.\nHowever, most computer scientists and developers believe that quantum computing is still a ways off, with Google and IBM engineers estimating that quantum computing won’t be sufficiently developed until 2029 at the earliest.\nMagazine: Google to fix diversity-borked Gemini AI, ChatGPT goes insane: AI Eye\nExchange or buy ETH\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd",
      "article_summary": "The technology required to make Ethereum immune from a quantum attack could be developed starting “tomorrow,” said Buterin.",
      "creation_date": "2024-03-11",
      "associated_tags": [
        "#Blockchain",
        "#Security",
        "#Ethereum",
        "#Supercomputer",
        "#Fork",
        "#Hard Fork",
        "#Cybersecurity",
        "#Quantum Computing"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/simple-hard-fork-subvert-quantum-attack-ethereum-vitalik-buterin",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "Binance exit sparks fears and opportunities in Nigeria’s crypto community",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/binance-exit-sparks-fears-and-opportunities-in-nigerias-crypto-community",
        "name": "Amaka Nwaokocha"
      },
      "article_detailed_content": "Local cryptocurrency stakeholders have lamented the current ban on Binance naira operations in Nigeria, stating it will affect the livelihoods of many Nigerians and could increase youth unemployment in the country.\nIn separate interviews with Cointelegraph, local crypto stakeholders said the delisting of Nigerian naira-related services from Binance will lead to the rise of new crypto exchanges, which will fill the vacuum created by Binance’s exit by complying with local regulations.\nNathaniel Luz, the CEO of Flincap — a liquidity platform for crypto exchanges — said that several Nigerian traders who make a living from trading peer-to-peer on Binance are now affected. However, Luz said that some are trading on WhatsApp and Telegram groups.\nAccording to the chief marketing officer of Flincap, Oladotun Wilfred Akangbe, the continuing uncertainty surrounding cryptocurrency regulation in Nigeria and the decision to halt Binance operations can undermine the confidence of many people in the space. He added that it could lead to massive fear, uncertainty and doubt in Nigeria’s crypto space.\nIn an official statement on its website, Binance said it would automatically convert naira balances to Tether (USDT) from March 8 at 8:00 am UTC and cease support for naira deposits from March 5 at 2:00 pm.\nWithdrawals have not been allowed since March 8 at 6:00 am, and the conversion rate is 1 USDT for 1,515.13 naira. Binance’s peer-to-peer platform delisted all naira trading pairs in late February.\nRelated: Binance temporarily suspends Solana network withdrawals, citing ‘increased volume’\nOn Feb. 27, the governor of the Central Bank of Nigeria argued that crypto exchanges in Nigeria were suspected of handling illicit transactions, pointing to “suspicious flows” of funds at Binance.\nAs the suspicions of Binance’s alleged illicit operations in Nigeria intensified, the Nigerian House of Representatives Committee on Financial Crimes called Binance CEO Richard Teng to appear before the committee before March 4.\nIn 2023, Nigeria’s Securities and Exchange Commission stated that Binance Nigeria wasn’t registered or regulated by it, making its operations in Nigeria illegal. In December 2023, the Central Bank of Nigeria reversed its stance on crypto assets, advising banks to ignore the previous ban on crypto transactions.\nMagazine: The DeFi bots pumping Solana’s stablecoin volume\nExplore more articles like this\nSubscribe to our Crypto Biz newsletter\nA weekly pulse of the business behind blockchain and crypto. Delivered every Thursday\nSubscribe",
      "article_summary": "According to local crypto stakeholder Nathaniel Luz, Nigeria’s crypto ecosystem will see the rise of new crypto exchanges that will fill the vacuum created by Binance’s exit.",
      "creation_date": "2024-03-10",
      "associated_tags": [
        "#Blockchain",
        "#Cryptocurrencies",
        "#Government",
        "#Nigeria",
        "#Cryptocurrency Exchange",
        "#Tokens",
        "#Binance",
        "#Regulation"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/binance-exit-sparks-fears-and-opportunities-in-nigerias-crypto-community",
      "website_source": "Coin Telegraph"
    },
    {
      "article_title": "MakerDAO implements temporary fee adjustments amid market volatility",
      "article_type": "Article",
      "author": {
        "last_post": "https://cointelegraph.com/news/binance-exit-sparks-fears-and-opportunities-in-nigerias-crypto-community",
        "name": "Amaka Nwaokocha"
      },
      "article_detailed_content": "MakerDAO, the organization responsible for the development of the Maker (MKR) token, has approved an “Executive Vote” to introduce temporary fee adjustments to strengthen the protocol due to heightened market volatility and bullish sentiment resulting in a reduction in reserves for its Dai (DAI) stablecoin.\nThe suggestion comes in response to a rapid decrease in the Dai supply from $5 billion to $4.4 billion in the last seven days, as outlined in the proposal from BA Labs, a member of Maker’s Stability Advisory Council.\nScreenshot of MakerDAO executive vote announcement on X. Source: MakerDAO\nIn the proposal, MakerDAO intends to expedite the approval process for a stablecoin stability measure if users choose to redeem a portion of the $1.1 billion in real-world assets (RWA) available on the protocol. Despite Dai being overcollateralized, using RWA vehicles as collateral poses potential liquidity issues if Dai’s selling continues.\n The proposal reads:\n“Liquid stablecoin reserves and reserves deployed to RWAs are more than sufficient to sustain the increasing pressure generated by the potential bullish market sentiment. The issue lies in the liquidity crunch inherent in the exposure toward stablecoins deployed through RWAs.” \nAlthough Maker DAO’s ecosystem is currently stable, it deems it necessary to anticipate potentially unpredictable user actions. The proposed measures include changes to Maker Vaults, the SparkLend DAI Borrow Rate, the Peg Stability Module (PSM), the Dai Savings Rate and the Governance Security Module (GSM) Pause Delay.\nRelated: Wyoming passes law granting DAOs legal status\nThe adjustments include raising the stability fees on different collateral assets registered on the platform from 15% to 17.25%. In addition, it plans to increase the SparkLend DAI Borrow annual percentage yield from the current 6.7% to 16%. The slate of changes was approved to go into effect from March 10 at 7:55 pm UTC.\nMakerDAO also plans to adjust the PSM to provide a cooldown for debt ceiling increases to drop from 24 to 12 hours. Other measures that will be implemented include incrementing the Dai Savings Rate to 15% and the GSM Pause Delay from 48 hours to 16 hours for swifter implementation of future adjustments.\nWhile these adjustments are temporary, there is no automatic process for reverting the fees. GFX Labs, a blockchain research and development company, expressed on the proposal’s discussion page that the changes were in the right direction but raised concerns about their magnitude, fearing potential market dislocations and disruptions.\nMagazine: Are DAOs overhyped and unworkable? Lessons from the front lines\nExchange or buy MKR\nDisclaimer: The information contained on this widget is not intended as, and shall not be understood or construed as legal, tax, investment, financial, or other advice. Nothing contained on this widget constitutes a solicitation, recommendation, endorsement, or offer by Cointelegraph or any third party service provider to buy or sell any cryptoassets or other financial instruments. We advise you to spend only what you can afford to lose, and always seek independent financial advice if you are in doubt. You should not purchase any cryptoassets if you do not fully understand the nature of your purchase and the risks involved. We recommend that you refer to the issuer’s/ advertiser’s t&c and help/ support pages for more information.\nAd",
      "article_summary": "The adjustments include changes to Maker Vaults, SparkLend DAI Borrow Rate, the PSM, the Dai Savings Rate (DSR), and the Governance Security Module (GSM) Pause Delay.",
      "creation_date": "2024-03-10",
      "associated_tags": [
        "#Blockchain",
        "#Decentralization",
        "#DAO",
        "#DeFi",
        "#MakerDAO"
      ],
      "category": "NEWS",
      "article_link": "https://cointelegraph.com/news/makerdao-implements-temporary-fee-adjustments-amid-market-volatility",
      "website_source": "Coin Telegraph"
    }
  ]
}